{"id":11059,"date":"2023-02-03T16:01:04","date_gmt":"2023-02-03T10:31:04","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11059"},"modified":"2023-02-03T16:01:04","modified_gmt":"2023-02-03T10:31:04","slug":"a-quick-glimpse-of-budget-2023-and-what-it-has-for-the-education-sector","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/a-quick-glimpse-of-budget-2023-and-what-it-has-for-the-education-sector\/","title":{"rendered":"A Quick Glimpse of Budget 2023 and What It Has for the Education Sector?"},"content":{"rendered":"\n<p>On Feb 1, 2023, Nirmala Sitharaman, the Union Finance Minister, presented the 2023 Budget in the new parliament. This is her fifth budget since 2019, outlining the government&#8217;s financial plans for the coming year.&nbsp;<\/p>\n\n\n\n<p>The budget for this year focuses on seven key priorities namely: inclusive growth, reaching the last mile, infrastructure and investment, unlocking potential, green growth, empowering youth, and strengthening the financial sector.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/distribution-of-budget-1.jpeg\" alt=\"distribution of budget\" class=\"wp-image-11060\"\/><\/figure>\n\n\n\n<p>The major highlight of this year’s budget is the introduction of five significant changes in personal income tax, including a revision of tax brackets under the new taxation system.<\/p>\n\n\n\n<p>Coming to the education sector, the Education Ministry in India has been striving to improve the quality of the country&#8217;s education system. And the Budget 2023 is a significant step towards this goal as it aims to bring substantial changes to the education sector.&nbsp;<\/p>\n\n\n\n<p>This year, the budget outlines many primary and higher education initiatives, allocation of research and innovation funds, and addresses the need for improved school infrastructure. This article will provide a brief overview of the education budget for 2023 and its impact on the education sector in India.<\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Budget 2023 Allocation for the Education Sector<\/h3>\n\n\n\n<p>A robust education sector is crucial for a nation&#8217;s growth. In India, every child between the ages of 6 to 14 has a constitutional right to free and compulsory education under various articles. However, education has not been a priority for the central or state governments, as it falls under the concurrent list of the Indian Constitution.&nbsp;<\/p>\n\n\n\n<p>Additionally, the Covid-19 pandemic has significantly impacted India&#8217;s education system, with schools and colleges being closed for nearly 20 months, leading to a dismal state of affairs.<\/p>\n\n\n\n<p>The Kothari Commission in 1964 advised raising education spending to 6% of the Gross Domestic Product (GDP). Despite this recommendation, over the past five decades, the education budget in the country has always remained within 3.5% of the GDP.<\/p>\n\n\n\n<p>As per the Economic Survey 2021-22, the combined expenditure on education by the central and state governments has remained at 2.8% of GDP from 2014-20. However, due to the impact of the pandemic, this figure rose to 3.1% through 2020-22.&nbsp;<\/p>\n\n\n\n<p>This year, the total spending on education is 2.9% of the nation&#8217;s GDP. The education budget this year saw a considerable rise, with a record allocation of ₹1.12 lakh crore, an 8% increase from last year&#8217;s 1.04 lakh crore budget allocation.<\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Key Highlights of India’s Education Budget 2023<\/h3>\n\n\n\n<p>The pandemic-related lockdowns have significantly impacted India&#8217;s school children, leading to loss of years of education for many students, particularly in government schools and rural areas.&nbsp;<\/p>\n\n\n\n<p>After three years of disruption, the education sector is eager for a fresh start, with the government placing a focus on upskilling the youth and increasing digitization. As a result, the highest-ever allocation for the education sector of INR 1.12 lakh crore ($13.66 Bn) was announced in the Union Budget 2023-24.&nbsp;<\/p>\n\n\n\n<p>The allocation for school education has increased by 8% from INR 63,449 crore ($7.74 Bn) in 2022-23 to INR 68,804 crore ($8.39 Bn) in 2023-24. While higher education has been allotted INR 44,094 crore in 2023-24, as opposed to INR 40,828 crore in 2022-23, indicating a 7.9% increase.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><\/td><td>2022-23<\/td><td>2023-24<\/td><\/tr><tr><td>School Education<\/td><td>INR 63,449 crore<\/td><td>INR 68,804 crore<\/td><\/tr><tr><td>Higher Education<\/td><td>INR 40,828 crore<\/td><td>INR 44,094 crore<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>The Finance Minister, Nirmala Sitharaman, unveiled a series of measures to address the growing education disparities. Key takeaways from the education budget 2023 include:<\/p>\n\n\n\n<ul><li>A National Digital Library will be established for children and young adults, making quality books accessible regardless of geography, language, genre, level, or device.<\/li><\/ul>\n\n\n\n<ul><li>To ensure a skilled workforce for future medical technologies and research, existing institutions will offer dedicated multidisciplinary courses for medical devices.<\/li><\/ul>\n\n\n\n<ul><li>Over the next three years, the central government will hire 38,800 teachers and support staff for 740 Ekalavya schools that serve 3.5 lakh tribal students. The budget for Eklavya Model Residential Schools (EMRS) has seen a significant increase of INR 581.96 crore, rising from INR 1418.04 crore in 2021-22 to INR 2,000 crores in the 2022-23 financial year. This initiative will provide support to residential schools aimed at educating tribal students.<\/li><\/ul>\n\n\n\n<ul><li>To foster a reading culture and to compensate for learning loss during the pandemic, the National Book Trust, Children&#8217;s Book Trust, and other entities will be encouraged to supply regional language and English books along with other materials to physical libraries.<\/li><\/ul>\n\n\n\n<ul><li>An integrated online training programme will be set up to enhance skills for Civil Servants and government employees.<\/li><\/ul>\n\n\n\n<ul><li>Selected ICMR lab facilities will be made accessible for outside research, and a programme to boost pharmaceutical research and innovation will be launched. Additionally, 157 new nursing colleges will be established alongside the 157 medical colleges established since 2014.<\/li><\/ul>\n\n\n\n<ul><li>Under the Mission Karma Yogi initiative, the centre, states, and Union Territories are executing capacity-building programmes for Civil Servants. Additionally, an integrated online training platform has been launched to provide continuous learning opportunities and upgrade the skills of numerous government employees, promoting a people-centric approach.<\/li><\/ul>\n\n\n\n<ul><li>The training of teachers will be revamped through innovative pedagogy, curriculum delivery, ongoing professional development assessments, and the implementation of information and communication technology. The District Institute of Education and Training (DIET) will be transformed into a dynamic institute of excellence for this purpose.<\/li><\/ul>\n\n\n\n<ul><li>100 labs will be established in engineering institutions with partnerships between various organisations such as regulators, banks, and businesses to develop 5G-based applications. These labs will focus on innovative areas such as smart classrooms, precision agriculture, intelligent transportation systems, and healthcare, with the aim to maximise the potential for new business models and job opportunities.<\/li><\/ul>\n\n\n\n<ul><li>The fourth edition of PM Kaushal Vikas Yojana 4.0 will be launched.<\/li><\/ul>\n\n\n\n<ul><li>30 Skill India International Centers will be established across various states to equip the youth for international opportunities.<\/li><\/ul>\n\n\n\n<ul><li>To achieve the goals of &#8220;Make AI in India&#8221; and &#8220;Make AI Work for India&#8221;, three centres of excellence for artificial intelligence will be established in top educational institutions.<\/li><\/ul>\n\n\n\n<ul><li>The government will offer an R&amp;D grant to one of the IITs to promote the production of domestically-grown laboratory diamonds and decrease imports.<\/li><\/ul>\n\n\n\n<ul><li>The finance minister announced the launch of cutting-edge courses for Industry 4.0, including coding, AI, IoT, mechatronics, drones, and other crucial soft skills. Additionally, 30 Skill India International Centers will be established across the country.<\/li><\/ul>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Impact of the Budget on the Education Sector<\/h3>\n\n\n\n<p>The 2023 Union Budget heavily focuses on teacher training, capacity-building programmes, and promoting a culture of reading.&nbsp;<\/p>\n\n\n\n<p>The lack of quality teachers has been a long-standing issue in the Indian education system. And so, the current focus on hiring many teachers and developing a sustainable training programme via innovative methods, curriculum transformation, professional development, and ICT implementation will significantly enhance the quality of education in Indian schools.&nbsp;<\/p>\n\n\n\n<p>Empowering young people through nationwide apprenticeship programmes like the PM Kaushal Vikas Yojana 4.0, will offer promising career prospects.&nbsp;<\/p>\n\n\n\n<p>The budget also announces 30 new Skill India International Centers to offer cutting-edge programmes in coding, AI, IOT, mechatronics, and drones and enhance soft skills. This is a phenomenal initiative for the growth and advancement of vocational education in the education sector.<\/p>\n\n\n\n<p>A major achievement of this budget is the creation of a National Digital Library for children and young people, offering high-quality resources in multiple languages. This will boost the government&#8217;s efforts to promote digital learning in rural and remote areas and contribute to India&#8217;s goal of becoming a tech powerhouse in the coming years.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/education-budget-2023-1.jpeg\" alt=\"education-budget-2023\" class=\"wp-image-11061\"\/><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion<\/h3>\n\n\n\n<p>With an 8% increase in educational allocation, this year&#8217;s budget focuses on upskilling the youth and increasing digitization while addressing education disparities. The budget outlines initiatives such as establishment of a National Digital Library, hiring of teachers for tribal schools, training programmes for Civil Servants and government employees, and the development of 5G-based applications in engineering institutions. Despite the budget allocation remaining at 2.9% of GDP, the highest-ever allocation for the education sector of INR 1.12 lakh crore demonstrates the government&#8217;s commitment to improving the education system in India.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On Feb 1, 2023, Nirmala Sitharaman, the Union Finance Minister, presented the 2023 Budget in the new parliament. This is her fifth budget since 2019, outlining the government&#8217;s financial plans for the coming year.&nbsp; The budget for this year focuses on seven key priorities namely: inclusive growth, reaching the last mile, infrastructure and investment, unlocking &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/a-quick-glimpse-of-budget-2023-and-what-it-has-for-the-education-sector\/\"> <span class=\"screen-reader-text\">A Quick Glimpse of Budget 2023 and What It Has for the Education Sector?<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":11064,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[323],"tags":[324,325],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11059"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11059"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11059\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/11064"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11059"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11059"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}