{"id":11125,"date":"2023-03-01T12:11:05","date_gmt":"2023-03-01T06:41:05","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11125"},"modified":"2023-04-12T03:40:26","modified_gmt":"2023-04-12T03:40:26","slug":"womens-day-in-india-celebrating-their-achievements-and-contributions","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/womens-day-in-india-celebrating-their-achievements-and-contributions\/","title":{"rendered":"Women&#8217;s Day in India: Celebrating Their Achievements and Contributions"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\"><p><em><strong>“One is not born, but rather becomes a woman” <\/strong><\/em><\/p><cite><em>-Simone De Beauvoir<\/em><\/cite><\/blockquote>\n\n\n\n<p>India is a land of paradoxes, especially when it comes to women. On one hand, we believe that all the cosmic energies have been created by a woman, on the other, we consider daughters to be a burden and commit female foeticide. On one hand, a woman is worshipped by people all over the nation, on the other, they are confined to the four walls of the kitchen. On one hand, we call them Annapurnas, while on the other they are suffering from malnutrition and domestic violence. On one hand, the government is in a constant endeavour to empower women by initiating campaigns such as “Beti Bachao, Beti Padhao”; on the other, #MeToo has become a sad reality in working places.&nbsp; But the positive change in the contemporary world is that people now embrace girl child, and celebrate women’s day in India owing to women’s role in society &amp; in various movements.<\/p>\n\n\n\n<p>On this auspicious occasion of <em>Antarrashtriya Mahila Diwas<\/em> (International Women’s Day), let&#8217;s raise a toast to all the powerful, courageous, intelligent, and beautiful women of India who have best played their parts as mothers, sisters, guides, mentors, and a friend to their families as well as to this world.&nbsp;<\/p>\n\n\n\n<p>Now, let’s take a trip down memory lane and discover how the women of India have always played an essential part in the growth and development of the nation. These women motivate us to celebrate women’s day in India and recognise their achievements and contribution.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Female Legends of Indian History<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/women-day-in-india2-1.jpg\" alt=\"\" class=\"wp-image-11126\"\/><\/figure>\n\n\n\n<p>Women and their sacrifices are undoubtedly a significant part of the ancient and mediaeval period in Indian history. They have always proved themselves equal to or even greater than men in every field. From fiercely fighting against British rule to setting high standards in the education sector, from handling household chores to managing the whole nation,&nbsp; women of every era have always marked their remarkable presence in almost every sector.&nbsp;<\/p>\n\n\n\n<p>Here are some extremely powerful and influential Indian women who made the nation proud with their immense physical and mental strength-<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>1. Rani Lakshmi Bai<\/strong><\/h3>\n\n\n\n<p>“Khoob Ladi Mardani Vo Toh Jhansi Wali Rani Thi” is a tribute to the bravest woman fighter in India. She fought tooth and nail against the British Army carrying a newborn child at her back with the horse&#8217;s reins in her mouth. Lakshmi Bai never agreed to surrender and kept fighting till death because it was not a piece of land but her respect and dignity which was at stake. Everyone was amazed and inspired by the valour she showed in the fight, and how bravely she embraced her victory even after being defeated.&nbsp;<\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>2. Razia Begum<\/strong><\/h3>\n\n\n\n<p>An epitome of courage and bravery, Razia Begum was the first and the last woman Sultan of Delhi. Carrying her father’s legacy forward,  she kept on fighting for her identity, against all odds prevailing in the society that was continuously conspiring against her. She ferociously fought along with her army and was defeated by her own brother Muizuddin Bahram Shah and was imprisoned at Qila Mubarak in Bathinda.<\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>3. Anandi Bai Joshi<\/strong><\/h3>\n\n\n\n<p>Anandi Bai Gopal Rao Joshi was the first female Indian Physician. She was forcefully married at the age of 9 and conceived her first child at the age of 14. Due to a lack of proper medical care, the child passed away within 10 days, and that was the defining moment in her life. She decided to practise medical sciences backed up by the full support of her husband. She completed her medical course at the Women&#8217;s Medical College of Pennsylvania and even inspired many women in India to study medical education. She died at the early age of 22 due to Tuberculosis, even before she could practise medicine in her country.  But she left a legacy of strength and courage behind her which enlightened many of the women around her.<\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>4. Savitri Bai Phule<\/strong><\/h3>\n\n\n\n<p>Along with being the first female teacher in India, Savitri Bai Phule was a social reformer who was keen to help women break free from the shackles of caste discrimination, inequality, and the lack of education. Along with the support of her husband, she broke many social barriers, one of which included opening the first school for girls when it was unacceptable for women to gain an education. Besides her social work, Savitri Bai even encouraged people through her literary works to fight for their rights.  <\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Indian Women Revolutionising Today’s World<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/women-day-in-india1-1.jpg\" alt=\"\" class=\"wp-image-11127\"\/><\/figure>\n\n\n\n<p>There are many women who helped in the growth of the nation when we got liberated from British rule. They stood strong and helped shape the country’s future. Many women in today’s world are immensely contributing towards each and every sector of the economy. They stand as pillars of inspiration for modern Indian women and give us pride in celebrating Women’s day.<\/p>\n\n\n\n<p>Some of the women who have been inspiring us are:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>1. Indira Gandhi<\/strong><\/h3>\n\n\n\n<p>Also known as the “Iron Lady of India”, Indira Gandhi carried the heritage of one of the strongest women in the country. She was majorly responsible for the partition of Bangladesh &amp; Pakistan and India’s triumph over Pakistan in 1971. She was a fierce all-rounder who focused on making India a self-reliant country and promoted development, nationalism, politics, equality, and justice. <\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>2. Mary Kom<\/strong><\/h3>\n\n\n\n<p>Being one of the most inspiring women athletes and a five-time World Amateur Boxing Champion, she holds the tag of “The Unbreakable”. Breaking the stereotypes with her utmost dedication and hard work, she became a great influence on women of the nation who thought that married women could not become successful athletes. Her strong determination and great mental strength made her an inspiration to many young girls and women in the nation. <\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>3. Isha Ambani<\/strong><\/h3>\n\n\n\n<p>From setting an example as the youngest female entrepreneur to making a place in the Forbes list of powerful women entrepreneurs of the country, Isha Ambani has come a long way in the business industry. Very few know that the ideation of Reliance Jio was done by Isha Ambani at a very early age. She is currently the director at Reliance Jio Infocomm and Reliance Retail Ventures and an idol to many.<\/p>\n\n\n\n<div style=\"height:4px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>4. Ritu Karidhal<\/strong><\/h3>\n\n\n\n<p>Also known as the “Rocket Woman Of India”, Ritu Karidhal was the Deputy Operations Director of the mission MOM (Mars Orbiter Mission), which created the first Mission by India to reach Mars in their first attempt. Being an ardent sky watcher since childhood, she achieved her dreams despite the difficulties she faced. Heading a large team of female scientists working on the mission, the success of the mission proved to be a win-win situation for her which proved that women can even fly the highest if given the chance to. <\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Significance of Celebrating the Women’s Day in India<\/strong><\/h2>\n\n\n\n<p>March 8th is celebrated as International Women’s Day worldwide where people come out in rallies and campaigns and celebrate the achievements and contributions of women all over the world.&nbsp;<\/p>\n\n\n\n<p>The Campaign theme for International Women’s Day this year is “Embrace Equity” as suggested by the IWD website and the official theme as announced by the UN is “Digital ALL: Innovation and Technology for Gender Equality”.<\/p>\n\n\n\n<p>The campaign aims at recognising and celebrating the women and girls who are championing the advancement of transformative technology and digital education.<\/p>\n\n\n\n<p>The United Nations is standing strong and fighting for the rights of women and the acknowledgement they deserve in every sector. And this continued to fight over the years for their rights is marked by the celebration of International Women’s Day all over the globe.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Takeaway<\/strong><\/h2>\n\n\n\n<p>Life would be simply unthinkable without women. They should be celebrated every day, their efforts should be valued by everyone because their mere presence would bring wonders into our lives. They should be appreciated for what they have been doing and thanked for all they have done. Women help us sail through the storm of challenges we face in our lives. They make the world a better place to live in.&nbsp;<\/p>\n\n\n\n<p>So, on this International Women’s Day let us all take a pledge to thank each and every woman in our lives and make sure to keep them happy with our little efforts in every possible way.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“One is not born, but rather becomes a woman” -Simone De Beauvoir India is a land of paradoxes, especially when it comes to women. On one hand, we believe that all the cosmic energies have been created by a woman, on the other, we consider daughters to be a burden and commit female foeticide. On &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/womens-day-in-india-celebrating-their-achievements-and-contributions\/\"> <span class=\"screen-reader-text\">Women&#8217;s Day in India: Celebrating Their Achievements and Contributions<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":11130,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[352],"tags":[353,354],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11125"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11125"}],"version-history":[{"count":1,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11125\/revisions"}],"predecessor-version":[{"id":11254,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11125\/revisions\/11254"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/11130"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11125"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11125"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11125"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}