{"id":11167,"date":"2023-03-17T11:18:42","date_gmt":"2023-03-17T11:18:42","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11167"},"modified":"2023-04-12T04:45:05","modified_gmt":"2023-04-12T04:45:05","slug":"the-advent-of-edutainment-how-technology-is-changing-the-way-we-learn","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/the-advent-of-edutainment-how-technology-is-changing-the-way-we-learn\/","title":{"rendered":"The Advent of Edutainment: How Technology is Changing the Way We Learn"},"content":{"rendered":"\n<p>Were you an “Art Attack” fan? Or somebody who enjoyed “Dora the Explorer”? If yes, then you are in for a treat. Both these examples fit the new and evolving concept of “Edutainment”.&nbsp;<\/p>\n\n\n\n<p>But are you wondering what Edutainment is? As per a recent definition, edutainment is a type of entertainment that is intended to both teach and amuse. According to studies, Poor Richard’s Almanack by Benjamin Franklin is considered the earliest account of the field. He created a manual for the laymen that included both fun and instructive materials, such as puzzles and moral guidelines. Later, it is said that Walt Disney used the term edutainment to describe his &#8220;True-Life Adventures&#8221; television series.<\/p>\n\n\n\n<p>So, the concept of entertainment infused in education is not new.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">Are you Inspired by Sheldon Cooper to Win a Nobel Prize?&nbsp;<\/h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>&#8220;I&#8217;m Not Crazy. My Mother Had Me Tested.&#8221;<\/em><\/p>\n<cite><em>Sheldon Cooper, Big Bang Theory<\/em><\/cite><\/blockquote>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"506\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/big-bang-theory.jpg\" alt=\"big bang theory\" class=\"wp-image-11168\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/big-bang-theory.jpg 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/big-bang-theory-300x169.jpg 300w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/big-bang-theory-768x432.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<p>Who doesn’t know this super famous dialogue? If you don’t, let’s throw some light on the matter at hand.&nbsp;<\/p>\n\n\n\n<p>The dialogue is from an American sitcom, The Big Bang Theory. The show is centred around four friends who are at the top of their careers in Science. Over the period of time, the audience learns that, Dr. Sheldon Cooper and Dr. Leonard Hofstadter opted for science because in their childhood, they were inspired by Professor Proton, the children&#8217;s science show host. He used to demonstrate scientific principles using everyday objects. Which is the perfect example of edutainment.&nbsp;<\/p>\n\n\n\n<p>Another character that was introduced on the TV Show was Bill Nye or popularly known as Bill Nye- The Science Guy. He too, used the tricks of daily life to explain the most complex scientific theories. Additionally, he had his own shows and movies such as “Bill Nye, The Science Guy”; “Bill Nye Saves the World” and others.&nbsp;<\/p>\n\n\n\n<p>Evidently, it testifies that when education is clubbed with entertainment, it helps students understand better, they learn the practical aspect of the most difficult concepts and they are also inspired to choose that field as in the case of Sheldon Cooper.&nbsp;<\/p>\n\n\n\n<p>Over the period of time, many video games, toys, innovative websites, and youtube channels have been introduced based on this concept. But, before we look at some of these examples, you should know how much contribution it has made and what’s next in the store. According to market researcher Ambient Insight, revenues from educational-games increased from 2.6 billion USD in 2016 to 7.3 billion USD in 2021.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Learn with John Green and Code with Barbie&nbsp;<\/strong><\/h2>\n\n\n\n<p>Now that you know what edutainment is, let’s look at some examples that have built and impacted the industry:&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">1. <strong>Crash Course&nbsp;<\/strong><\/h3>\n\n\n\n<p>With more than 14.6K subscribers, Crash Course is among the most-watched educational youtube channels. Started by John Green and Hank Green, the channel is your shortcut to learning anything and everything. From Economics to Literature to Computer Science, they create short, easy, and intelligible videos that are easily understood by laymen.&nbsp;<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">2. <strong>ABC Mouse<\/strong><\/h3>\n\n\n\n<p>With more than 850 lessons and 9,000 learning exercises, the ABCmouse.com website is an award-winning online resource for kids of the ages 2 to 6. It offers courses in more than 10 distinct levels. Additionally, it offers teachers a fresh approach to teaching subjects. Even higher test scores have been reported by some of the teachers who have employed it. The website has also received “A Teachers&#8217; Choice Award” from Learning Magazine.&nbsp;<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">3. <strong>Tynker.com<\/strong><\/h3>\n\n\n\n<p>Tynker or Teach Your Kids to Code is a platform that has incorporated edutainment in its teaching methodology. The platform runs a popular course, that is Coding With Barbie. It uses the iconic fashion doll to teach students of the age seven and above. Additionally, it also has multiple learning tools for parents and teachers.&nbsp;<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">4. <strong>Workbench.com<\/strong><\/h3>\n\n\n\n<p>Workbench is a dynamic project-based learning system that focuses on full&nbsp; STEAM learning, that is, it caters to Science, Technology, Engineering, the Arts, and Mathematics. It offers a variety of entertaining games for all ages across all disciplines. Additionally, it pays special attention to “build, find, customise, and share standards-aligned lessons for your classroom.”<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">5. <strong>JobSimulatorGame.com<\/strong><\/h3>\n\n\n\n<p>Launched by Owlchemy Labs, JobSimulatorGame.com focuses on giving users an all-round experience of working on different jobs using virtual reality.&nbsp;<\/p>\n\n\n\n<p>The website has already got a spot in Teq.com&#8217;s list of “Edutainment and Entertainment Games to Use in Your Classroom.”<\/p>\n\n\n\n<p>The list does not end here, some of the other examples are: Boulevard, It’s OK to Be Smart, LEGO and others. <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"458\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/education-entertainment-countinuum.jpg\" alt=\"education entertainment continuum\" class=\"wp-image-11174\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/education-entertainment-countinuum.jpg 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/education-entertainment-countinuum-300x153.jpg 300w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/education-entertainment-countinuum-768x391.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Edutainment: Black or White? Or Grey?&nbsp;<\/strong><\/h2>\n\n\n\n<p>With every new concept, there come doubts and the question if you can rely on it. Similarly, edutainment has both sides. On one hand students are making the most out of this breakthrough innovation. On the other, there are rising concerns about them growing accustomed to fancy entertainment items to the point where we run the risk of them being dependent on such models for learning. This is largely the reason why some people are sceptical of employing edutainment technologies and material in education.<\/p>\n\n\n\n<p>Let’s look at some other cons of this method:&nbsp;<\/p>\n\n\n\n<ol>\n<li>As much as the country has progressed, there are still some areas where students don’t have access to technology, mobile phones, or even good wifi connection.&nbsp;<\/li>\n\n\n\n<li>No doubt, smartphones are a distraction. Hence, it might interrupt the learning process.<\/li>\n\n\n\n<li>A greater emphasis on technology and gamification can lead to a complete lack of human interaction between teacher-students as well as peers.<\/li>\n\n\n\n<li>Schools and other learning institutions are yet to adapt and accept this new system.&nbsp;<\/li>\n<\/ol>\n\n\n\n<div style=\"height:7px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>On the flip side, “media literacy” is what India is focusing on. Hence, we can not neglect the advantages, which are:<\/p>\n\n\n\n<ol>\n<li>With edutainment, it is believed that students will be more engaged.<\/li>\n\n\n\n<li>Digital platforms are a hub of information, students can pick anything that they wish to study.<\/li>\n\n\n\n<li>These platforms are not age-restricted.&nbsp;<\/li>\n\n\n\n<li>It also helps students to explore more and enhance their imagination.<\/li>\n<\/ol>\n\n\n\n<p>Using digital resources in the classroom “helps students master tools they’ll need both personally and professionally to thrive in a tech-based world” as claimed by a research conducted by Tech Edvocate.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Following the Footsteps of South Tapiola High School, Finland<\/strong><\/h2>\n\n\n\n<p>Though, the question remains the same, “Is society ready to adopt edutainment or do we still have some scruples?” Indubitably, the system is still new, can reach heights, and even do wonders in the education industry. But the way in which education is imparted must change if we are to teach the abilities required to succeed in the 21st century and produce the leaders.&nbsp;<\/p>\n\n\n\n<p>According to a study by Microsoft, the human attention span is just 8 seconds which calls for innovative techniques in the education sectors to hook students. The best example of this is South Tapiola High School, Finland which has an industry-oriented curriculum that caters to the subjects that have been flourishing in the 21st century such as entrepreneurship, active citizenship, and many more. Additionally, the school has collaborated with Microsoft and Dell to incorporate technology into their academics.&nbsp;<\/p>\n\n\n\n<p>We live in a world that is fast-paced. Hence, edutainment is not far away.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Do You Think about Edutainment?&nbsp;<\/strong><\/h2>\n\n\n\n<p>Have you tried any edutainment platforms or techniques? If you have what you have to say about it, let us know in the comment section.&nbsp;<\/p>\n\n\n\n<p>But if you haven’t, it is definitely a one-time try!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Were you an “Art Attack” fan? Or somebody who enjoyed “Dora the Explorer”? If yes, then you are in for a treat. Both these examples fit the new and evolving concept of “Edutainment”.&nbsp; But are you wondering what Edutainment is? As per a recent definition, edutainment is a type of entertainment that is intended to &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/the-advent-of-edutainment-how-technology-is-changing-the-way-we-learn\/\"> <span class=\"screen-reader-text\">The Advent of Edutainment: How Technology is Changing the Way We Learn<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[10],"tags":[366,367],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11167"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11167"}],"version-history":[{"count":2,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11167\/revisions"}],"predecessor-version":[{"id":11301,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11167\/revisions\/11301"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11167"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11167"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11167"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}