{"id":11182,"date":"2023-03-22T09:48:13","date_gmt":"2023-03-22T04:18:13","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11182"},"modified":"2023-04-12T03:40:26","modified_gmt":"2023-04-12T03:40:26","slug":"us-bank-crisis-and-what-we-can-learn-from-it","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/us-bank-crisis-and-what-we-can-learn-from-it\/","title":{"rendered":"US Bank Crisis and What We Can Learn from It"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\">\n<p>“Money moves from those who do not manage it to those who do.” <\/p>\n<cite>Dave Ramsay<\/cite><\/blockquote>\n\n\n\n<p>We all know what a bank is, right?<\/p>\n\n\n\n<p>The safe financial institution where we deposit our hard-earned money. Nothing can harm our savings if we keep them in the bank. They are the protector of our money.&nbsp;<\/p>\n\n\n\n<p>But what if all this is a myth?&nbsp;<\/p>\n\n\n\n<p>No financial institution, no matter how big they are, guarantees to keep your deposits safe. It can only provide you with a platform where you can save your money and use it at your convenience.&nbsp;<\/p>\n\n\n\n<p>Now before jumping to today’s topic of discussion, that is, the infamous SVB Bank collapse, you should know a bit about the history of US bank failures. But first, let’s understand why banks fail.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">Why Does Bank Failure Occur?<\/h2>\n\n\n\n<p>Bank failure refers to when a bank cannot meet the demand of the public, investors and depositors. It can occur when a bank is unable to pay the debt or does not have enough liquid assets such as cash or gold. This is generally due to the wrong investment decisions taken by the bank officials or due to the accumulation of huge bad loans. This creates panic among the public, and they rush to banks to liquidate their deposits. Thus, it leads to a <em>“bank run”.<\/em> <\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">What is Bank Run?<\/h2>\n\n\n\n<p>Bank run refers to the term when customers lose trust in the abilities of the bank to take care of their money and start to get worried about their deposits in the bank and thus, rush to the bank to withdraw their entire deposits at once. When all of the bank&#8217;s customers withdraw simultaneously at the same time, the bank runs out of liquid assets like cash and is unable to meet the demand of the customers. This causes the bank’s cash to run dry which, in turn, leads to its collapse.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">The History of US Bank Failures<\/h2>\n\n\n\n<p>The Great Depression is known as the worst economic collapse in the modern history of the US. It started in 1929 with the stock market&#8217;s fall and continued till the late 1930s. During this phase, unemployment reached 20%, and more than 5,000 banks went bankrupt. This caused fear and panic among people, and the money supply in the country collapsed. John Poole, the president of the Federal American National Bank, assured shareholders in 1933 that the banks in the US would not collapse but later in that year, 4,000 US banks collapsed.<\/p>\n\n\n\n<p>Later in the year 2008, the US witnessed another depression with the collapse of Washington Mutual Bank. At that time, the bank had assets worth $307 billion and deposits of $188 billion. It was then sold by the Federal Deposit Insurance Corporation to JPMorgan Chase for a mere $1.9 billion.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"555\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse.png\" alt=\"silicon valley bank collapse\" class=\"wp-image-11183\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse.png 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-300x185.png 300w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-768x474.png 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">The Collapse of Silicon Valley &amp; Signature Banks<\/h2>\n\n\n\n<p>Silicon Valley Bank was started in 1983 to support the growth of the startup industry. SVB was the 16th-largest bank in the USA and had assets worth $209 billion.<\/p>\n\n\n\n<p>But the question remains what went wrong with Silicon Valley Bank? The answer is simple.&nbsp; It didn’t have enough cash to pay its customers. This is majorly due to the wrong investment decisions taken by the bank officials.&nbsp;<\/p>\n\n\n\n<p>SVB had deposited most of its assets in government bonds which are considered to be the safest form of investment. These government-issued bonds had low-interest yields and would have generated good returns over the period of time. But to control the inflation rate of the US, the Federal Reserve hiked the interest rates of the bond; as a result, the price of the bond fell. Since the price of the bond and its annual yield are inversely proportional, the bank suffered a loss of $1.8 billion. To meet the withdrawal request of the depositors, the bank had to sell some of its bonds at a loss. Then it tried to raise funds through investment which also failed, creating panic among its investors. This led to the bank&#8217;s stock price falling by 60% in a single day.&nbsp;<\/p>\n\n\n\n<p>Federal Deposit Insurance Corporation took over the bank operations and its deposits to control panic and meet the customers&#8217; demand. SVB’s $175 billion deposits are now under the control of FDIC, and its assets are put up for auction.<\/p>\n\n\n\n<p>When the news about the collapse of Silicon Valley Bank spread, Signature Bank’s customers had withdrawn billions of dollars worth of deposits. To control the deposit rate and prevent a bank run, FDIC closed the bank on March 12.&nbsp; It had assets worth $110 billion and over $89 billion in deposits. FDIC has created a bridge bank called Signature Bridge Bank, where customers can use the same banking facility and can retain their deposit in the account. This is the third-largest bank failure in US history.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"942\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-explained.jpg\" alt=\"silicon valley bank collapse explained\" class=\"wp-image-11184\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-explained.jpg 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-explained-287x300.jpg 287w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/silicon-valley-bank-collapse-explained-768x804.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">What Can We Learn from the US Bank&#8217;s Failure?<\/h2>\n\n\n\n<p>The US has a black history in financial markets. From the great depression to high inflation, its market has incurred huge losses. This has affected people, investors, venture capitalists and shareholders. The sudden collapse of the bank has taught us that even highly qualified &amp; experienced people can make bad investment decisions. We believe the bank keeps our money safe but generates a good return by investing. When that investing fails, whose money fails, ours, correct?<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">What can Banks learn from US Bank&#8217;s failure? <\/h2>\n\n\n\n<p>As stated by Srinath Sridharan, Author, Policy Researcher and Corporate Advisor, <em>“They (banking and financial institutions) should not be swayed by the greed of higher interest rates to put all their deposits in one single entity. The lesson for the Indian financial institution is simple — improve their risk management framework and have a real-time analysis of Asset Liability Management (ALM). With every interest rate swing, the ALM needs reinforcement.”<\/em><\/p>\n\n\n\n<p>According to reports, the collapse can create short-term panic but it will not affect the economy as a whole because there are bigger players in the market. Although it will affect the startups because the bank was established with the motive to facilitate them.&nbsp;<\/p>\n\n\n\n<p>It is imperative for the banks to diversify their assets that can help them to create liquidity in terms of card or gold immediately.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">Monopoly and Wall Street<\/h2>\n\n\n\n<p>The current bank crisis, draws for us a very realistic picture of how the economic sector is hegemonized by one or two big financial institutions. For instance, if we look at Wall Street, there is a monopoly of banks like SVB, Goldman Sach, and Fortress. Thus, it becomes critical for us as an economy to retrace our steps and counter this supremacy as the failure of one bank can shatter the stock market and thus, the entire economy of a country.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">Impact on the Indian Economy <\/h2>\n\n\n\n<p>Although the Indian startups do not depend on foreign investment, to quote Jyoti Prakash Gadia, the Managing Director of Resurgent India<em> “As SVB was primarily a major banker for the startups in the US, the startup ecosystem in India is also likely to be impacted adversely.”<\/em><\/p>\n\n\n\n<p>Evidently, Indian corporations that have holdings or subsidiaries in the US and kept accounts with SVB will be affected. Although, the number is less but is not negligible. One such example is Nazara Tech which has INR 60 crore trapped in one of the SVB companies.&nbsp;<\/p>\n\n\n\n<p>It is worth noting that the Indian Startup Economy will face issues but only for a short period of time.&nbsp;<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Takeaway<\/strong><\/h2>\n\n\n\n<p>Has the economy been severely affected? Are people taking sides? Well, of course, people always do. Rishi Sunak, the prime minister of the United Kingdom, declared that he will always support businesspeople, inventors, and young people who are creating the future. He also said that<em> “What really matters for economic success – is innovation. If we want our country to succeed, we need to do what we’ve always done and embrace new technologies and the people and culture that create them.”<\/em><\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"461\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/economic-success-quote.jpg\" alt=\"economic success quote\" class=\"wp-image-11185\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/economic-success-quote.jpg 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/economic-success-quote-300x154.jpg 300w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/03\/economic-success-quote-768x393.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<p>All parties concerned are working towards solutions but it Is unclear whether the global economic worries will be resolved by SVB and Signature Banks or if another significant development will soon emerge. Others, like the startup ecosystem, will also need to be agile in order to move forward in the correct way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Money moves from those who do not manage it to those who do.” Dave Ramsay We all know what a bank is, right? The safe financial institution where we deposit our hard-earned money. Nothing can harm our savings if we keep them in the bank. They are the protector of our money.&nbsp; But what if &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/us-bank-crisis-and-what-we-can-learn-from-it\/\"> <span class=\"screen-reader-text\">US Bank Crisis and What We Can Learn from It<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":11187,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[371],"tags":[372,373],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11182"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11182"}],"version-history":[{"count":1,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11182\/revisions"}],"predecessor-version":[{"id":11245,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11182\/revisions\/11245"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/11187"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}