{"id":11232,"date":"2023-02-04T09:41:10","date_gmt":"2023-02-04T04:11:10","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11065"},"modified":"2023-02-04T09:41:10","modified_gmt":"2023-02-04T04:11:10","slug":"adani-pulling-the-largest-con-in-corporate-history-as-unfolded-by-hindenberg","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/adani-pulling-the-largest-con-in-corporate-history-as-unfolded-by-hindenberg\/","title":{"rendered":"Adani Pulling the Largest Con in Corporate History: As Unfolded by Hindenberg"},"content":{"rendered":"\n<p>On 24th January when the whole nation was celebrating Naatu Naatu’s Oscar nomination, there popped up a report which not only attacked the reputation of India’s richest man but also made us all think about the dark side of the corporate world.&nbsp;<\/p>\n\n\n\n<p>Following the release of the report, Gautam Adnani has lost his leading position in the list of world’s richest individuals. The 106 page long report was released by the US-based financial research company- Hindenburg Research and highlighted the ugly truth about the Indian conglomerate.&nbsp;<\/p>\n\n\n\n<p>This is not the first time that corporate fraud has hit the Indian landscape. In the past, there have been many instances where malpractices like Corporate Fraud, Financial Scams, Tax Evasion, etc. became a hurdle in the growth of businesses all over the nation and adversely impacted the economy. <\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Adani Group of Companies<\/h3>\n\n\n\n<p>Driven by its vision of Growth with Goodness, Adani Group has been a major contributor to the nation’s GDP. Even during the difficult times of COVID when the country was struggling from the perils of the pandemic, the company stood united with the government to provide essential supplies to the needy. If we talk about the country’s commitment to Sustainable Development Goals, Adani Group has been a frontrunner in reducing the country’s carbon footprint. The Group has been actively promoting green infrastructure in the nation.&nbsp;<\/p>\n\n\n\n<p>However, the Hindenburg Report has painted an entirely different picture for us. And naturally, it has impacted not just the Group’s reputation but has also taken a toll on its performance. Ever since the release of the report, Adani has suffered from:<\/p>\n\n\n\n<ul><li>Adani Enterprises&#8217; share price reduced significantly and hit an intraday low of ₹2,858.05 on NSE, experiencing a 4 percent dip on Wednesday session.<\/li><li>&nbsp;Adani Power&#8217;s share price today hit a 5 percent lower circuit within a few minutes of market opening.&nbsp;<\/li><li>Similarly, Adani Total Gas share price saw 10 percent lower circuit in early morning deals.<\/li><li>&nbsp;Adani Green Energy&#8217;s share price experienced a downfall of around 4%, and Adani Transmission is quoting 3.50% lower from its Tuesday close.&nbsp;<\/li><li>ACC share price is as low as 2% whereas it dipped around 3% in the early morning session.<\/li><li>Adani Ports&#8217; share price too witnessed heavy selling and hit an intraday low of ₹598 apiece on NSE, recording a 2%&nbsp; intraday dip on Wednesday session.<\/li><\/ul>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><a href=\"https:\/\/hindenburgresearch.com\/adani\/\">Hindenburg Report&nbsp;<\/a><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">What Is Hindenburg?<\/h3>\n\n\n\n<p>Hindenburg is a financial research, investment, and whistleblower organisation who perform the function of short selling. Hindenburg picks up the organisations which have vulnerabilities, analyses them based upon extensive research and investigation. It investigates every aspect of the business to pin down all the potential irregularities, mismanagement, and unrevealed transactions that might affect the investors negatively in the long run. After this, they release detailed reports on their findings for public information and eventually end up shorting those stocks and making a large amount of money out of them.&nbsp;<\/p>\n\n\n\n<p>Time and again, Hindenburg has unveiled many scams by trailing the companies which they found to be malicious and had certain credible evidence against them. Twitter and Nikola are among the companies which were short-sold by Hindenburg.&nbsp;<\/p>\n\n\n\n<p>If we look at Nikola, it is a classic case of short selling wherein the company was shorted by Hindenburg and created a lot of hassle in the market. There was a considerable decline in its market value, witnessing a steep decline from $34 billion to $1.3 billion. A similar fear is now knocking at the doors of Adanis.&nbsp;<\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">What is Short Selling?<\/h3>\n\n\n\n<p>Short-Selling is an investment strategy that operates on the basis of speculation of decline in the value of a stock. In short selling, an investor first borrows the shares of a stock that he believes will decline in price. He then sells these borrowed shares to those buyers who are willing to pay the current market price with the belief that he can later buy it for a lesser price. Theoretically speaking, the risk factor on a short-sale is very high, there is no limit to it as the stock market is very volatile and the price of any share can climb up to infinity.<\/p>\n\n\n\n<p>Let us take an example to understand it better. Let’s say that the current price of a stock is INR 100, and the investor speculates that it would go down in the near future, so he would sell that share for INR 100.&nbsp;<\/p>\n\n\n\n<p>Now after 3 months the share price has decreased to INR 60, so the investor would buy the stock at INR 60.&nbsp;<\/p>\n\n\n\n<p>This difference between the selling and the buying price is the short seller’s profit.<\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Allegations Made by Hindenburg on Adani<\/h3>\n\n\n\n<p>The various allegations made by Hindenburg Report can be listed as follows-&nbsp;<\/p>\n\n\n\n<ul><li>Stock Price Manipulation<\/li><li>Accounting Fraud<\/li><li>Corruption&nbsp;<\/li><li>Money Laundering<\/li><li>Setting Up Offshore Dummy Accounts<\/li><li>Tax Evasion<\/li><\/ul>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Key Findings of the Report<\/h3>\n\n\n\n<p>The Hindenburg report on Adani Group is a comprehensive statement unveiling the white collar crimes that have been taking place in the organisation for the past few decades. They have released a sagacious report with an extensive research and investigation, and all the sources related to this are quite legitimate and credible.&nbsp;<\/p>\n\n\n\n<p>Some of the major points highlighting the issue are mentioned as follows-<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. Debt-Fueled Business with a Short Term Liability Problem:<\/h4>\n\n\n\n<p>A large amount of Adani’s personal as well as organisational wealth has increased tremendously in the past 3 years (after 2020), despite the recession and a downfall in the markets due to COVID.&nbsp;<\/p>\n\n\n\n<p>As per the findings of the report, an aggregate of US $120 billion of wealth has been generated with over US $100 due to the meteoric appreciation of its stock prices which means that both the wealth of the company as well as the stock prices increase at the same rate.&nbsp;<\/p>\n\n\n\n<p>The stock price has increased immensely and the reason behind this is Debt Fueled Growth, which means the amount of money an enterprise is borrowing and re-investing in the business is reflected as an increase in the stock price.&nbsp;<\/p>\n\n\n\n<p>5 out of 7 listed Adani companies are facing the problem of a lower Current Ratio. This means that the assets are valued half compared to the liabilities because. This indicates that the company runs the risk of not meeting its obligations in the short run.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"500\" height=\"250\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.24-PM-1-copy.webp\" alt=\"\" class=\"wp-image-11067\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.24-PM-1-copy.webp 500w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.24-PM-1-copy-300x150.webp 300w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/figure>\n\n\n\n<p>*Source- <a href=\"https:\/\/www.forbes.com\/profile\/gautam-adani-1\/?sh=40d96f015b0e\">Forbes<\/a><\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">2. Promoters Are Pledging Their Stocks:<\/h4>\n\n\n\n<p>Promoters pledge their highly valued stocks in exchange for the debt. Being a detrimental sign for the company, it indicates that there is an excessive amount of indebtedness on the company.<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">3. Shady Practices by the Company Management:<\/h4>\n\n\n\n<ul><li><a href=\"https:\/\/indianexpress.com\/article\/cities\/ahmedabad\/rajesh-adani-held-for-fraud-gets-bail\/\">Rajesh Adani<\/a>, the current Managing Director of Adani Enterprises was jailed in a fraud case and held responsible for tax evasion which proved to be unfavourable for the company.<\/li><li>Samir Vora, brother-in-law of Gautam Adani, was involved in the diamond trading scam and was continuously making false statements to the market regulators.<\/li><li>Another case was that of Vinod Adani, the elder brother of Gautam Adani, who has been alleged of managing the separate offshore entities which were used to facilitate the fraud. He was also speculated by DRI as a mediator used by Adani Group to import the overvalued equipment into the country. However, the group got the clean chit afterwards.<\/li><\/ul>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">4. Stock Price Manipulation:<\/h4>\n\n\n\n<p>The float of the company is quite less. As shown in the graph, the promoter holdings of the company are quite high. The promoter owns 73% (maximum permissible is 75%) of the company and the rest of the shares are owned by the external parties,like the public, FII’S, DII’s etc.<\/p>\n\n\n\n<p>Movement of the Stock prices:<\/p>\n\n\n\n<p>Stock Prices are axiomatically dependent on the demand and supply conditions prevailing in the market.<\/p>\n\n\n\n<p>For example, if the demand of the stock is very high but there’s no supply, the stock prices would skyrocket.<\/p>\n\n\n\n<p>For a comparison, Yes Bank has 4 crore shares in the open market whereas Adani Group has only 4 lakh.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"900\" height=\"290\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-copy.webp\" alt=\"\" class=\"wp-image-11068\" srcset=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-copy.webp 900w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-copy-300x97.webp 300w, https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-copy-768x247.webp 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/figure>\n\n\n\n<p>*Source: <a href=\"https:\/\/www.screener.in\/company\/ADANIENT\/consolidated\/\">Screener<\/a><\/p>\n\n\n\n<p>Therefore, as per Hindenburg report, Adani is manipulating the stock pattern by creating a series of offshore shell companies that are buying Adani’s stocks, thus maintaining a very small proportion of the float. This entire gambit has helped them im pumping up the stock prices in the market.<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">5. Offshore Shell Companies:<\/h4>\n\n\n\n<p>A bunch of offshore shell companies comprise the largest public non- promoter funds of Adanis. Certain companies in <a href=\"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/four-mauritius-based-funds-with-7-bn-in-adani-stocks-have-history-of-wrong-bets\/articleshow\/84813494.cms?from=mdr\">Mauritius and Cayman Islands<\/a> have ties to Adani. These shell companies own a large part of the leftover value of the company, such that the actual float that is left is quite less.&nbsp;<\/p>\n\n\n\n<p>For instance, Monterosa Investment Holdings controls 5 supposedly independent funds that collectively hold over INR 360 billion (U.S. $4.5 billion) in shares of listed Adani companies. In fact, most of their investment is in Adani&#8217;s group only.<\/p>\n\n\n\n<p>By maintaining a large part of their holdings for their shell companies, the Adanis made sure to keep only a meagre part of its shares for the public.&nbsp;<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">6. Dubious Associates:<\/h4>\n\n\n\n<p>A good management and a worthy team of auditors are required for looking into the transparency aspect of the company. But in the case of Adanis, it was not holding any value.<\/p>\n\n\n\n<p>For eg- <a href=\"https:\/\/www.sebi.gov.in\/enforcement\/orders\/aug-2016\/adjudication-order-against-monarch-networth-capital-in-the-matter-of-networth-stock-broking-ltd_33120.html\">Monarch Networth Capital<\/a> was an Indian Brokerage Firm which looked after the financial operations of Adani Green Ltd. However, this company itself was speculated by SEBI for violations of certain provisions.&nbsp;<\/p>\n\n\n\n<p>As per the report, Adanis also had relations with Ketan Parekh who was banned from trading in the Indian market for the practice of stock manipulation. However, in the past, Adanis were accused of their relations with Parekh and were even banned as a penalty. But the punishment was eventually reduced to just fines by the government.<\/p>\n\n\n\n<p>In addition to this, there were also many internal issues related to the audit partners of the Adani Enterprises. The auditors in the Shah Dhandaria and co. were quite young &amp; freshly qualified C.A’s and didn&#8217;t have the experience &amp; knowledge to analyse &amp; scrutinise the financial accounts of such a large &amp; well-established company.&nbsp;<\/p>\n\n\n\n<div style=\"height:3px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">7. Hyperinflated Stocks:<\/h4>\n\n\n\n<p>The stocks of the Adani Enterprises are quite over inflated due to the practice of Stock manipulation.&nbsp;<\/p>\n\n\n\n<p>Apart from this, other key takeaways from the report can be listed as follows-<\/p>\n\n\n\n<ul><li>The Indian Mutual Fund companies have stayed away from the Adani Enterprises. They have not invested any bit in the Adani companies.<\/li><li>LIC (Life Insurance Corporation of India) has invested a massive 98% of the Insurance Industry’s Investment in Adani’s Group. The value of their investment of 7300 crore has spiked up to around 72,200 crore in the last week itself.&nbsp;<\/li><\/ul>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\"><br>Other Reports Issued Against Adanis<\/h3>\n\n\n\n<h4 class=\"wp-block-heading\">1. The Morning Context-&nbsp;<\/h4>\n\n\n\n<p>In October 2022, it speculated the auditing practices of the Adani Enterprises with reference to the Shah Dhanaria and Dharmesh Parekh and co.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-1-copy.webp\" alt=\"\" class=\"wp-image-11069\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-2-copy.webp\" alt=\"\" class=\"wp-image-11070\"\/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\">2. Fitch Group Firm Report:<\/h4>\n\n\n\n<p>The<a href=\"https:\/\/www.financialexpress.com\/industry\/adani-group-is-deeply-overleveraged-says-fitch-group-firm-report\/2641671\/\"> Fitch Group<\/a> report says that Adani Group is deeply overleveraged. The rapid expansion and diversification of the company using debt has led to the firm being highly overleveraged which is not a good sign for such a well established company.&nbsp;<\/p>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Adani’s Side of the Story<\/h3>\n\n\n\n<p>As a comeback against the report issued by Hindenburg Research, Adani issued a 413- page reply that called the short-seller’s claims “stale, baseless, and discredited allegations.”<\/p>\n\n\n\n<p>In addition to this, the company also called the report a “calculated attack on India, the independence, integrity, and quality of Indian institutions, and the growth story and ambition of India.”<\/p>\n\n\n\n<p>As per the report-<\/p>\n\n\n\n<ul><li>Adani declared that Hindenburg wants to make financial gains at the cost of countless investors.<\/li><li>According to Adani, it is a calculated attack on the company by Hindenburg considering the largest ever FPO of INR 20,000 crore which was to be made by the Adani Enterprises.&nbsp;<\/li><li>The 88 questions by Hidenburg are quite frivolous as they are not based on any facts or judgements. Apart from this 65 questions relate to the matters that have been disclosed in the company portfolio and the website. Out of the remaining 23 questions, 18 relate to public shareholding and the third parties and 5 are merely based on imaginary facts.<\/li><li>The company has significantly reduced its debt in the past decade through operational efficiency. Apart from this, in the last 9 years, the EBITDA of the enterprise has increased with a CAGR of 22%, while the debt in the same period has risen with a CAGR of 11%.<\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.23-PM-3-copy.webp\" alt=\"\" class=\"wp-image-11071\"\/><\/figure>\n\n\n\n<ul><li>Considering the concerns of High Promoter Pledging, Adani Group stated that they have significantly reduced the promoter pledging from 2020.<\/li><li>Adani’s reply also stated that their auditors are duly certified and qualified as per the norms of the relevant statutory bodies. And that they are appointed within the compliance of the applicable norms.&nbsp;<\/li><li>All the foreign and offshore entities are declared as public shareholders and that they have no control over who buys\/ sells and owns the publicly traded shares and how much volume is traded.&nbsp;<\/li><li>All the allegations on Samir Vora and Rajesh Adani are all a part of public disclosures and are already dismissed in the past in the favour of Adani Group.&nbsp;<\/li><\/ul>\n\n\n\n<div style=\"height:5px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">The Hindenburg-Adani Narrative Continues<\/h3>\n\n\n\n<p>In a response to Adani’s claims, <a href=\"https:\/\/www.thehindu.com\/business\/Industry\/adani-response-confirms-findings-ignores-key-questions-hindenburg-on-adani-rebuttal\/article66449151.ece\">Hidenburg has declared<\/a>&#8211; “Fraud cannot be obfuscated by Nationalism Or A Bloated response That Ignores Every Key Allegation We Raised”..<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/WhatsApp-Image-2023-02-03-at-9.11.24-PM-copy.webp\" alt=\"\" class=\"wp-image-11072\"\/><\/figure>\n\n\n\n<p>Iit will be interesting to watch what happens next and how both the parties justify their positions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On 24th January when the whole nation was celebrating Naatu Naatu’s Oscar nomination, there popped up a report which not only attacked the reputation of India’s richest man but also made us all think about the dark side of the corporate world.&nbsp; Following the release of the report, Gautam Adnani has lost his leading position &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/adani-pulling-the-largest-con-in-corporate-history-as-unfolded-by-hindenberg\/\"> <span class=\"screen-reader-text\">Adani Pulling the Largest Con in Corporate History: As Unfolded by Hindenberg<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":11066,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[327],"tags":[326,328,329],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11232"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11232"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11232\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/11066"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11232"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11232"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11232"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}