{"id":11234,"date":"2023-02-11T09:41:00","date_gmt":"2023-02-11T04:11:00","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=11088"},"modified":"2023-02-11T09:41:00","modified_gmt":"2023-02-11T04:11:00","slug":"confused-about-which-stream-of-mba-is-best-for-you-10-decisive-points-to-consider","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/confused-about-which-stream-of-mba-is-best-for-you-10-decisive-points-to-consider\/","title":{"rendered":"Confused About Which Stream of MBA is Best for You? 10 Decisive Points to Consider"},"content":{"rendered":"\n<p>Pursuing an MBA degree can be considered a wise investment for your future as it opens up a world of opportunities for career advancement and higher salaries. However, deciding on the best MBA specialisation for the future can be a very challenging decision, especially when so many options are available. To help you make an informed decision, and <a href=\"https:\/\/www.learningroutes.in\/top-5-essential-tips-to-prepare-yourself-for-the-job-market\/\">prepare for the job market<\/a>, we have compiled a list of 10 decisive points that you should consider before deciding whether an MBA stream will be a wise choice for your future goals.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">List of MBA Specialisations<\/h3>\n\n\n\n<p>While there are various streams in MBA, here are some of the most popular ones that the top universities and institutes offer:<\/p>\n\n\n\n<ol><li>Operations Management<\/li><li> Business Management<\/li><li> Financial Management<\/li><li> Marketing Management<\/li><li> Banking and Finance Management<\/li><li> Retail Management<\/li><li> International Trade Management<\/li><li> Human Resource Management<\/li><li> Supply Chain Management<\/li><li> Information Technology and Systems Management<\/li><\/ol>\n\n\n\n<div style=\"height:7px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-embed is-provider-youtube wp-block-embed-youtube\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"ast-oembed-container\" style=\"height: 100%;\"><iframe loading=\"lazy\" title=\"MBA Specialisations &amp; Their Scope: Part 1| Learning Routes Official\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/hvEzoOi9OhM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div><\/figure>\n\n\n\n<div style=\"height:7px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>Let us discuss each MBA stream first, as it is essential to have a thorough understanding of all streams before deciding which stream of MBA is the best choice for you<\/strong><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">1. MBA in Operations Management<\/h4>\n\n\n\n<p>An MBA in Operations Management endows students with the skills and knowledge to effectively manage and streamline the operations of execution, production, manufacturing, and service organisations. With a focus on key areas such as Inventory Management, Vendor Management, Purchase Management, and Enterprise Resource Planning, Operations Management specialists aim to improve productivity, quality, cost, and turnaround time, delivering value to the end customer.<\/p>\n\n\n\n<p>Coursework in this speciality covers topics such as Project Management, Pricing &amp; Revenue Management, Operations Strategy, and Behavioural Operations Management, among others.&nbsp;<\/p>\n\n\n\n<p>With its broad applicability across various industries, including Telecom, IT, and E-Commerce, an MBA in Operations Management offers a range of career paths, including roles such as:<\/p>\n\n\n\n<ul><li>Procurement Manager<\/li><li>Plant\/Facility Manager&nbsp;<\/li><li>Logistics\/Distribution Manager<\/li><li>Supply Chain Manager<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">2. MBA in Business Management<\/h4>\n\n\n\n<p>MBA in Business Management is a Master&#8217;s degree program that focuses on developing <a href=\"https:\/\/educationcareergrowth.blogspot.com\/2022\/12\/why-do-we-need-skill-based-education.html\">essential skills<\/a> like business leadership, and management. The program typically covers a wide range of business-related topics, including Finance, Marketing, Operations, Strategy, Economics, and Organizational behaviour.<\/p>\n\n\n\n<p>The goal of an MBA in Business Management is to prepare students for senior-level management positions in various industries, including finance, consulting, technology, and healthcare. The program provides students with a strong foundation in business concepts and practical skills, as well as the opportunity to specialize in a particular area of interest through elective courses.<\/p>\n\n\n\n<p>Overall, an MBA in Business Management can be a valuable investment for individuals who want to pursue careers in senior management and leadership positions, and who are seeking to enhance their business skills and knowledge.<\/p>\n\n\n\n<p>Some popular career paths in the field include:<\/p>\n\n\n\n<ul><li>Product Manager<\/li><li>Business Consultant<\/li><li>Customer Relation Manager<\/li><li>Market Design Coordinator<\/li><li>Marketing Consultant<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">3. MBA in Finance<\/h4>\n\n\n\n<p>An MBA in Finance provides students with an understanding of how to manage money efficiently. The field encompasses the management of assets and liabilities over time while considering uncertain conditions and risks.&nbsp;<\/p>\n\n\n\n<p>Areas of study include Budgeting, Derivatives, Tax Planning, Banking, Corporate Restructuring, Investment Analysis, Portfolio Management, Financial Markets, and Services. Eventually, you become good at managing finances and investments, and it&#8217;s no surprise that it can help you attain <a href=\"https:\/\/www.learningroutes.in\/unlock-financial-freedom-with-distance-mba-degree\/\">financial freedom<\/a>. With finance being a critical component of business operations, an MBA in finance opens the door to a range of career opportunities like:<\/p>\n\n\n\n<ul><li>Investment Banking<\/li><li>Asset Management<\/li><li>Hedge Funds&nbsp;<\/li><li>Private Equity&nbsp;<\/li><li>Portfolio Management&nbsp;<\/li><li>Credit Risk Management<\/li><li>Derivatives<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">4. MBA in Marketing<\/h4>\n\n\n\n<p>Studying for an MBA in Marketing involves researching the management process by which goods and services progress from concept to the customer. It includes the 4 P&#8217;s of marketing: Product, Price, Place, and Promotion. The Marketing division of any company holds the responsibility of bringing in new business, expanding market share, and augmenting the company&#8217;s revenue.&nbsp;<\/p>\n\n\n\n<p>Those opting for specialisation in marketing will gain knowledge in fields such as market research, consumer behaviour, sales management, brand management, social media marketing, retail management, and digital marketing. To be a successful marketing professional, an individual should have strong interpersonal and analytical skills.&nbsp;<\/p>\n\n\n\n<p>Marketing professionals can have roles such as:<\/p>\n\n\n\n<ul><li>Sales Manager<\/li><li>Sales Architect<\/li><li>Business Analyst<\/li><li>Retail Marketing Associate<\/li><li>Social Media Manager<\/li><li>Email Marketing Manager<\/li><li>Social Advertising Executive<\/li><li>Marketing Designer<\/li><li>Marketing Analyst<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">5. MBA in Banking and Finance Management<\/h4>\n\n\n\n<p>An MBA in Banking and Finance Management is a specialized degree program that focuses on the study of financial markets, institutions, and products. This specialisation provides students with the knowledge and skills necessary to succeed in the competitive and constantly evolving financial services industry.<\/p>\n\n\n\n<p>The curriculum covers topics such as Investment Analysis, Corporate Finance, Financial Risk Management, Banking Regulations<\/p>\n\n\n\n<p>Students learn how to analyze financial data, develop investment strategies, evaluate financial products and make informed financial decisions.&nbsp;<\/p>\n\n\n\n<p>The goal of the program is to prepare students for careers in banking and finance, where they can work in areas such as:<\/p>\n\n\n\n<ul><li>Corporate Finance<\/li><li>Investment Banking<\/li><li>Risk Management<\/li><li>Financial Analysis<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">6. MBA in Retail Management<\/h4>\n\n\n\n<p>An MBA in Retail Management is a specialized degree program that focuses on the study of retail operations and strategy. The curriculum covers topics such as Retail Marketing, Consumer Behaviour, Supply Chain Management, Visual Merchandising, and e-Commerce. Students learn how to analyze consumer trends and create effective marketing strategies, manage inventory and supply chain operations, and analyze sales data to make informed decisions.&nbsp;<\/p>\n\n\n\n<p>Some popular career paths in the field include:<\/p>\n\n\n\n<ul><li>Merchandising Manager<\/li><li>Store\/ Retail Manager<\/li><li>Display Specialist<\/li><li>Customer Service Representative<\/li><li>Advertising Manager<\/li><li>Business Development Officer<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">7. MBA in Human Resources<\/h4>\n\n\n\n<p>The HR discipline equips students with the skills to effectively acquire, manage, and retain a workforce within a firm. It focuses on maintaining positive relationships between management and employees, resulting in a well-functioning and successful company.<\/p>\n\n\n\n<p>In this stream, one studies areas such as Recruitment, Job Design, Motivation, and Compensation. HR Management is crucial to the functioning of any company, with continuously growing job opportunities available globally.&nbsp;<\/p>\n\n\n\n<p>A career in HR offers various job titles such as:<\/p>\n\n\n\n<ul><li>HR Generalist<\/li><li>Staffing Manager<\/li><li>Technical Recruiter<\/li><li>Employee Relations Manager<\/li><li>HR Training and Development Manager<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">8. MBA in International Business<\/h4>\n\n\n\n<p>International Business encompasses the exchange of goods, services, technology, capital, and knowledge on a global scale. Pursuing a Master&#8217;s in International Business allows students to gain a comprehensive understanding of the organisational skills necessary for successful international operations. The curriculum covers a range of topics like International Marketing, Trade Laws, Export &amp; Import Management, International Finance, and HRM.<\/p>\n\n\n\n<p>Some popular career paths in the field include:<\/p>\n\n\n\n<ul><li>Export Managers<\/li><li>International Business Development Managers&nbsp;<\/li><li>International Finance Managers&nbsp;<\/li><li>Consultants&nbsp;<\/li><li>Marketing Managers<\/li><li>Brand Managers<\/li><li>International Logistics Managers<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">9. MBA in Supply Chain Management<\/h4>\n\n\n\n<p>An MBA in <a href=\"https:\/\/www.learningroutes.in\/5-reasons-to-study-mba-in-supply-chain-management\/\">Supply Chain Management<\/a> is a specialized degree program that focuses on the study of the end-to-end flow of goods and services, from the procurement of raw materials to the delivery of finished products to customers. The curriculum covers topics such as Logistics, Purchasing, Production Planning, Transportation, Inventory management, and more.<\/p>\n\n\n\n<p>Students learn how to design and manage efficient supply chain networks, evaluate and negotiate with suppliers, and use data and technology to drive operational improvements. The goal of the program is to prepare students for careers in supply chain management, where they can help companies optimize their operations, reduce costs, and improve customer satisfaction.<\/p>\n\n\n\n<p>Some popular career paths in the field include:<\/p>\n\n\n\n<ul><li>Logistics Coordinator<\/li><li>Procurement Specialist<\/li><li>Operations Manager<\/li><li>Supply Chain Analyst<\/li><li>Transportation Manager<\/li><li>Customer Service Manager<\/li><li>Supply Chain Consultant<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">10. MBA in Information Technology<\/h4>\n\n\n\n<p>The objective of this specialisation is to equip students with a comprehensive understanding of computer systems and their applications in managerial decision-making. In today&#8217;s rapidly advancing technological landscape, there is a growing demand for professionals with a blend of business and technical expertise. You can flourish in your future with <a href=\"https:\/\/www.learningroutes.in\/top-6-tech-careers-of-the-future\/\">high-paying tech jobs<\/a>.<\/p>\n\n\n\n<p>The Management Information Systems (MIS) curriculum covers subjects such as data mining, <a href=\"https:\/\/www.learningroutes.in\/benefits-of-doing-mba-in-data-science-programme\/\">Data Science<\/a>, Software Project Management, Digital Innovation and Transformation, IT Consulting, E-Commerce, and Strategic IT Management. MIS provides students with the tools to collect, analyse, and interpret data to make informed decisions in support of an organisation&#8217;s objectives.&nbsp;<\/p>\n\n\n\n<p>The demand for professionals in this field is on the rise, leading to a multitude of job opportunities, including positions such as:<\/p>\n\n\n\n<ul><li>Data Analyst<\/li><li>Data Scientist<\/li><li>Database Administrator<\/li><li>Information Systems Manager<\/li><li>IT Consultant<\/li><li>Technical Support Specialist&nbsp;<\/li><li>Systems Analyst&nbsp;<\/li><li>Information Security Manager<\/li><li>Application Analyst<\/li><\/ul>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Tips to Pick the MBA Specialisation For the Future<\/h3>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" src=\"https:\/\/www.learningroutes.in\/wp-content\/uploads\/2023\/02\/tips-to-choose-best-mba-specialisation-1.webp\" alt=\"tips-to-choose-best-mba-specialisation\" class=\"wp-image-11092\"\/><\/figure>\n\n\n\n<p>Now that you are familiar with the most sought-after MBA specialisations, let&#8217;s explore how to make an informed decision in selecting the ideal MBA programme for you. Here, we have listed a few things that you must keep in mind while selecting an MBA stream.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">1. Career Goals<\/h4>\n\n\n\n<p>Deciding MBA in which stream is the best for you requires careful consideration of your career aspirations. It&#8217;s important to take into account the type of job you want after graduation and the industry that appeals to you. By aligning your specialisation with your career goals, you will be able to focus your studies and gain the skills and knowledge necessary to achieve success. Take the time to evaluate what you want to achieve in your career, and let that guide your choice of specialisation.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">2. Industry Trends<\/h4>\n\n\n\n<p>Staying acquainted with industry trends is crucial when selecting which stream of MBA is the best for you. Understanding which industries are flourishing and which are experiencing a downturn is crucial to making an informed decision. Before settling on a specialisation, it is recommended to assess the prospects of your chosen industry to ensure that your investment in an MBA degree will yield desired results. Stay informed and keep up-to-date with the latest trends to make an informed choice.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">3. Personal Interests<\/h4>\n\n\n\n<p>Personal Interests play a key role in determining your MBA specialisation. After all, you will be dedicating two years of study to your chosen subject. Hence, it is imperative to choose a specialisation that ignites your passion and interests. This not only makes the learning experience more enjoyable but also enhances your performance in your courses. Pursuing a specialisation that aligns with your interests ensures a fulfilling academic journey and sets you on the path towards fulfilling your career aspirations.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">4. Skill Set<\/h4>\n\n\n\n<p>Assessing your current skill set is a crucial step in choosing the right MBA specialisation. Consider both the skills you possess and the skills you wish to develop through your MBA programme. Different specialisations place varying demands on technical proficiency, <a href=\"https:\/\/www.learningroutes.in\/the-importance-of-communication-in-business-workplace\/\">communication abilities<\/a>, and leadership skills. By considering the skills you have and the skills you hope to acquire, you will be able to make a well-informed decision and select a specialisation that aligns with your personal and professional goals.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">5. Job Availability<\/h4>\n\n\n\n<p>When choosing an MBA specialisation, it is important to consider the job market and the availability of the type of position you desire. Analyse the demand for your desired job in your region and the job prospects for your target industry in the coming years. By considering these factors, you will be able to make an informed choice and select a specialisation that leads to fulfilling career opportunities. Ensure that your investment in an MBA degree is supported by a robust job market and a bright future outlook for your desired career path.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">6. Job Requirements<\/h4>\n\n\n\n<p>Having an understanding of the job requirements for the type of role you are aiming for post-graduation is essential in making an informed decision about your MBA specialisation. Having a specialised area of focus can be advantageous in increasing your chances of securing the job you want. Researching the job requirements and understanding the value of a specialised area of knowledge can help you make an educated decision about your MBA specialisation.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">7. Salary Expectations<\/h4>\n\n\n\n<p>When considering what MBA specialisation to pursue, take into account your salary expectations. Research the average salaries for the type of job you hope to attain post-graduation and select a specialisation that can help you reach your financial objectives.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">8. Networking Opportunities<\/h4>\n\n\n\n<p>Maximise the networking potential of your MBA specialisation by researching and attending professional organisations and events related to your desired industry. Networking is an invaluable tool for building relationships and getting your foot in the door when the time arrives for you to apply for jobs. Take advantage of your specialisation to make meaningful connections that may lead to a successful career.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">9. Work-Life Balance<\/h4>\n\n\n\n<p>When deciding on an MBA specialisation, take into account the associated work-life balance that comes with it. Do your research to determine the hours required, and select a field that allows you to maintain a healthy balance between your professional and personal life.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4 class=\"wp-block-heading\">10. Program Reputation<\/h4>\n\n\n\n<p>When researching an MBA programme, it is essential to consider its reputation within the industry you are interested in. You must consider looking into <a href=\"https:\/\/www.learningroutes.in\/what-are-university-rankings-and-accreditations\/\">awards and accreditations<\/a> before finalising a programme in a college. An excellent reputation can open doors for you in the future, so investigate whether the program has a positive standing among employers and if its alumni network is strong. A program with a robust alumni network can be especially beneficial, as it can provide invaluable insight into the job market and help you make crucial connections.<\/p>\n\n\n\n<div style=\"height:6px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Final Thoughts<\/h3>\n\n\n\n<p>People pursue an MBA to expand their knowledge and bolster their professional opportunities. However, to ensure the best results, it&#8217;s essential to make the right choice when it comes to selecting a field of specialization. To ensure that you make an informed decision on which stream of MBA is the best for you, carefully consider each point discussed in this blog. These key points will guide you towards the best MBA program for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pursuing an MBA degree can be considered a wise investment for your future as it opens up a world of opportunities for career advancement and higher salaries. However, deciding on the best MBA specialisation for the future can be a very challenging decision, especially when so many options are available. To help you make an &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/confused-about-which-stream-of-mba-is-best-for-you-10-decisive-points-to-consider\/\"> <span class=\"screen-reader-text\">Confused About Which Stream of MBA is Best for You? 10 Decisive Points to Consider<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":11091,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[47],"tags":[138,95,20,208],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11234"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11234"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/11234\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/11091"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11234"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=11234"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=11234"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}