{"id":8080,"date":"2021-06-03T16:41:21","date_gmt":"2021-06-03T11:11:21","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=8080"},"modified":"2021-06-03T16:41:21","modified_gmt":"2021-06-03T11:11:21","slug":"nmims-distance-mba-term-end-examination","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/nmims-distance-mba-term-end-examination\/","title":{"rendered":"NMIMS Distance MBA Term End Examination"},"content":{"rendered":"\n<p>The following document provides comprehensive information on Do’s and Don’ts for the exam, pre requisites, and how to manage different scenarios beyond the candidate’s control.<\/p>\n\n\n\n<p>Exam will be conducted only Online from student’s location of choice<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Things to remember<\/h3>\n\n\n\n<ul><li>This examination is conducted online via Mettl platform (our official assessment partner) through the student portal and will be remotely proctored.<\/li><li>Test compatibility usinghttps:\/\/tests.mettl.com\/system-check?i=db696a8e#\/systemCheckis the most important step and has to be checked on a regular basis, in case of issues please drop an email at support@mettl.com with a copy to ngasce@nmims.edu.<\/li><li>Student must ensure there are stable internet connectivity 512kbps of concurrent speed<\/li><li>For any reason if Internet connectivity is lost during exams, DO NOT close the browser, the exam will resume from where you stopped.<\/li><li>Please ensure the webcam and microphone of your system (laptop\/computer) is connected and functional, which can be also tested using compatibility test <a href=\"https:\/\/tests.mettl.com\/system- check?i=db696a8e#\/systemCheck\">https:\/\/tests.mettl.com\/system- check?i=db696a8e#\/systemCheck<\/a><\/li><li>Students are advised to use the latest version of web browsers Google Chrome or Mozilla Firefox for a seamless experience during the exam.<\/li><li>Students must ensure that they use the same system that was used for the System compatibility Check and Demo test to appear for the actual exam. Compliance on Compatibility check and Demo exam is a pre-requisite and is required to be performed every week and 24 hrs before every exam. In case you change your system, a system compatibility check on the new system is a mandate.<\/li><li>Students should ensure that they are not running\/attempting to start any remote access software before or during the exam. This will automatically close the exam browser and the examination will be interrupted and if found the same will be considered as a UFM case.<\/li><li>Students are not allowed to connect any extended screen\/projector along with the system being used during the exam.<\/li><li>Students should not browse\/ switch to other window or application during the exam.<\/li><\/ul>\n\n\n\n<ul><li>Usage of Mobile Phones, Tablets or any other electronic devices is strictly prohibited and not allowed during the exam and can be kept in a different room. If student is facing any tech issue, they can use the phone to call the Mettl support line<\/li><li>Scientific calculators will be provided on the exam screen; hence physical calculators are not required.<\/li><li>To maintain the sanctity of the examination, please ensure that you are the only person in the room during the exam and there is no disturbance. At any point of time during the exam, you can be asked by the proctor through chat, to rotate your Laptop\/Webcam to show your surroundings.<\/li><li>Students are not allowed to take a break or use the restroom during the examination.<\/li><li>University will initiate appropriate action in case a student is found to be not adhering to the aforesaid instructions \/ using unfair means\/ possessing any unauthorized material of any type.<\/li><li>Exam link by subject will be made available on the Student portal 2-3 days before the actual exam date, however the exam link will only be made active at the time of the booked slot.<\/li><li>Demo exam will be made available on Student portal for students to experience the exam interface, navigate screens, use various options available to answer descriptive questions<\/li><li>Please note this is not an Open book exam and proctor will be monitoring your exam real time <\/li><\/ul>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h3 class=\"wp-block-heading\">FAQ’s: <\/h3>\n\n\n\n<p><strong>Q. I don’t have the required bandwidth\/System\/Webcam for the exam?<\/strong> <br>You have enough time to make necessary arrangements, if you still are finding it difficult to arrange the IT infrastructure required at your home\/workplace to attempt these exams; you have the choice to wait. As soon as the government allows, we will also conduct center-based exams in Sept\/Oct. You can give your exams during that time. <\/p>\n\n\n\n<p><strong>Q. Minimum bandwidth and system requirement for the exam? <br><\/strong>Minimum speed 512 kbps of concurrent speed and ensure that there are no restrictions enabled on the network, which is being used. <\/p>\n\n\n\n<p><strong>Q. Can I come to campus to appear for this exam online? <br><\/strong>Exams will not be conducted on campus or any of the authorized partner centres<\/p>\n\n\n\n<p><strong>Q. What happens to exam duration when mettl team is troubleshooting issues?<\/strong><br>For any troubleshooting, the exam is paused and the student is given the time allocated for the exam post fixing the issue<\/p>\n\n\n\n<p><strong>Q. Is it ok if I take the compatibility test or\/and Demo exam at the beginning only will that work<\/strong><br>One has to perform regular checks and 24 hrs before every exam, both for compatibility and Demo exam<\/p>\n\n\n\n<p><strong>Q. I started the exam but got disconnected mid-way on account of Internet issues?<\/strong><br>If you get disconnected at the time of exam, system logs will be checked, post-authorization you will be able to resume your exam from the same point where it got disconnected but only when there is time left in the exam and disconnection duration is not more than 20 mins. If the duration of disconnection is more than 20mins, such situations will be managed in real-time on the day of the exam. In any situation do not close the browser<\/p>\n\n\n\n<p><strong>Q. Can I use a mobile hotspot?<\/strong><br>We do not recommend as the network is not stable and also the mobile device is not allowed during the exam<\/p>\n\n\n\n<p><strong>Q. Can I use a dongle or a portable WiFi Device?<\/strong><br>Yes if it fulfills the required bandwidth requirement<\/p>\n\n\n\n<p><strong>Q. How do I join my exam?<\/strong><br>Exam links will be made available on Student portal, step by step instructions with screenshots will be made available for ease of access<\/p>\n\n\n\n<p><strong>Q. Checklist- before the exam?<\/strong><br>1. Functional laptop\/desktop with inbuilt\/external webcam<br>2. Stable internet with minimum of 512 kbps of concurrent speed 3. Taken compatibility test 24hrs prior to every exam<br>4. Appeared for Demo exams<\/p>\n\n\n\n<p><strong>Q. Checklist- on the day of exam?<\/strong><br>1. Alone in the room<br>2. Well-lit room<br>3. College ID card\/Government ID card<br>4. Phone on silent mode not anywhere near you<br>5. Blank rough sheet, subjects where the calculation is required to be done<\/p>\n\n\n\n<p><strong>Q. Disconnect in between \/ not able to connect?<br><\/strong>The system will allow you to reconnect, if still unable to connect then contact mettl tech team.<\/p>\n\n\n\n<p><strong>Q. Unable to type descriptive answers?<br><\/strong>Ask the proctor to pause the exam and to connect with mettl tech team.<\/p>\n\n\n\n<p><strong>Q. Mettl team not answering or number busy?<br><\/strong>Email Mettl support helpline and contact NMIMS support helpline.<\/p>\n\n\n\n<p><strong>Q. Test loading or already completed?<br><\/strong>Check internet connection or Contact Mettl team.<\/p>\n\n\n\n<p><strong>Q. Resume button disable?<br><\/strong>After the start of exam resume button take 5 to 10 min to be enabled if still not enabled then contact Mettl support team.<\/p>\n\n\n\n<p><strong>Q. Unable to start exam from the portal?<br><\/strong>Understand what the exact error is and speak to NMIMS customer support.<\/p>\n\n\n\n<p><strong>Q. Portal not working \/ slow?<br><\/strong>Restart your internet router and try again.<\/p>\n\n\n\n<p><strong>Q. For any reason, you are not able to appear for the exam?<br><\/strong>Details to be mailed to ngasce@nmims.edu.<\/p>\n\n\n\n<p><strong>Q. Not feeling well?<br><\/strong>Prescribed doctor certificate to be mailed to ngasce@nmims.edu.<\/p>\n\n\n\n<p><strong>Q. Question not visible properly?<br><\/strong>Contact Mettl team and try to resolve the issue. If not solved then under every question there is a report issue tab, student can fill the feedback there.<\/p>\n\n\n\n<p><strong>Below scenarios will be checked and solution provided on case to case basis:<br><\/strong>Couldn&#8217;t join the exam as there was power outage at my place Couldn&#8217;t join the exam as there was Internet outage at my place<br>Exam interrupted mid-way and was not able to complete the examon account of Power failure\/Internet failure<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The following document provides comprehensive information on Do’s and Don’ts for the exam, pre requisites, and how to manage different scenarios beyond the candidate’s control. Exam will be conducted only Online from student’s location of choice Things to remember This examination is conducted online via Mettl platform (our official assessment partner) through the student portal &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/nmims-distance-mba-term-end-examination\/\"> <span class=\"screen-reader-text\">NMIMS Distance MBA Term End Examination<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":8106,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[62],"tags":[65,67,58,69],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8080"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=8080"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8080\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/8106"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=8080"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=8080"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=8080"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}