{"id":8275,"date":"2021-06-09T13:25:25","date_gmt":"2021-06-09T07:55:25","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=8275"},"modified":"2021-06-09T13:25:25","modified_gmt":"2021-06-09T07:55:25","slug":"class-12-board-exam-2021-update-on-exam-assessment-and-results","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/class-12-board-exam-2021-update-on-exam-assessment-and-results\/","title":{"rendered":"Class 12 Board Exam 2021: Update on Exam, Assessment, and Results"},"content":{"rendered":"\n<p>Keeping in view the ongoing pandemic and safety of students, the Centre and State took an important decision to <a href=\"https:\/\/www.learningroutes.in\/cancellation-of-class-12th-exam-2021-how-it-will-affect-students\/\">cancel the CBSE Class 12 Board exam<\/a> and various other State Board exams. The decision finalized on 1st June 2021 left students, teachers, and parents in a state of uncertainty with multiple queries regarding assessment policy and results declaration of Class 12.<\/p>\n\n\n\n<p>The Central Board of Secondary Education (CBSE) has formed a committee that will decide the criteria for evaluation. It has been notified that the committee will submit its report within 10 days from the date of issue of order. But on 6th June another important notification was released concerning CBSE Class 12 Board exam. As per the information, schools with pending practical exams or internal assessments will have to conduct the examination via online mode only and upload the marks for the same before 28th June 2021.<\/p>\n\n\n\n<p><strong>The circular also clarified the following important points for CBSE schools conducting online exam:<\/strong><\/p>\n\n\n\n<ul><li>The list of subjects, duration of exam, the appointment of an external examiner, and break-up of marks for theory, practical and internal assessment is available in detail on the CBSE website<\/li><li>For the subjects where no external examiner has been appointed, the concerned subject school teacher will conduct internal assessment according to the instructions in the curriculum and, upload the same at the link provided by Board<\/li><li>For the subjects where external examiners are appointed, he\/she will decide the date of examination in consultation with the internal examiner and conduct the same via online mode<\/li><li>The internal examiner should share information about the conduct of the exam well in advance with the students and share the link of online meeting with the external examiner and students<\/li><li>The school authorities should ensure the marks are uploaded soon after the exam. While uploading, only correct marks should be uploaded as no correction window will be allowed. The examiners should ensure that the marks allotted do not bunch towards maximum marks<\/li><li>On-screen photographs of the student, an internal examiner, and an external examiner should be taken while the conduct of viva-voce or else recording for the same can be kept. However, the policy for uploading group photos has been suspended.<\/li><li>Covid appropriate behavior should be followed strictly<\/li><li>External examiners should accept and complete the assignment in the given timeframe<\/li><li>There will be no extension of the last date for uploading the marks. It should be completed meticulously well before 28th June 2021<\/li><li>The policy for the conduct of the practical, project, and internal assessment will be declared soon<\/li><li>The rest of the conditions remain the same as communicated in the notification dated 11th Feb 2021<\/li><\/ul>\n\n\n\n<p><strong>The Central Board of Secondary Education (CBSE) is yet to upload relevant information regarding examinations, assessment, and results. Students should keep an eye on the official website of CBSE i.e. cbse.gov.in to have a piece of updated information.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Keeping in view the ongoing pandemic and safety of students, the Centre and State took an important decision to cancel the CBSE Class 12 Board exam and various other State Board exams. The decision finalized on 1st June 2021 left students, teachers, and parents in a state of uncertainty with multiple queries regarding assessment policy &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/class-12-board-exam-2021-update-on-exam-assessment-and-results\/\"> <span class=\"screen-reader-text\">Class 12 Board Exam 2021: Update on Exam, Assessment, and Results<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":8276,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[10],"tags":[72,73,68,74],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8275"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=8275"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8275\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/8276"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=8275"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=8275"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=8275"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}