{"id":8512,"date":"2021-06-21T17:48:49","date_gmt":"2021-06-21T12:18:49","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=8512"},"modified":"2021-06-21T17:48:49","modified_gmt":"2021-06-21T12:18:49","slug":"nmims-distance-mba-fees","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/nmims-distance-mba-fees\/","title":{"rendered":"NMIMS Distance MBA Fees"},"content":{"rendered":"\n<p>If you are contemplating pursuing a distance MBA program then look no further as the NMIMS distance MBA program is one the top priority B-school that provides various specialization courses for masters, diploma, executive, and certification program.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.learningroutes.in\/nmims-ngasce\/\">NMIMS Global Access School for Continuing Education<\/a>&nbsp;is India’s No.1 Distance Management University with exceptional corporate collaboration, recognition, and acceptance. It was founded in the year 1981 and the year 2003 it achieved deemed-to-be-university status. All the courses offered by NMIMS are recognized and approved by the University Grants Commission (UGC) and Distance Education Bureau (UGC-DEB) of India. The National Assessment and Accreditation Council (NAAC) have also accredited NMIMS with Grade A+ status with a CGPA of 3.59 on a 4 point scale.<\/p>\n\n\n\n<p>Moreover, NMIMS also provides first-of-its-kind career services in online education for students and alumni of post-graduate and diploma programs to prepare them for a lifetime of career possibilities. The institute has tie-up with leading corporates to provide students an interview opportunity along with student support and career assistance. As networking is an important part of an MBA, students have all-time access to an NMIMS exclusive alumni portal which strengthens peer interaction and provides opportunities for career growth.<\/p>\n\n\n\n<p>NMIMS is focused on giving students an enriching and engaging experience through enhanced learning and up-to-date technology. To stay relevant with the present industry needs, the curriculum is constantly updated and students get a chance to learn from coveted faculty, academicians, and industry expert. The NMIMS courseware is designed to help improve the knowledge, competencies, and skills of working professionals and MBA aspirants so that they are better equipped to become leaders in the field.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>NMIMS-NGASCE Distance MBA Fee Structure<\/strong><\/h2>\n\n\n\n<p>NMIMS is one of the <a href=\"https:\/\/www.learningroutes.in\/best-distance-learning-mba-programs-in-india\/\">best distance MBA institutes<\/a> in terms of return on investment. The fee structure is quite affordable for the quality of education provided. Following is the fee structure for the <a href=\"https:\/\/www.learningroutes.in\/nmims-mba-admission\/\">Distance MBA program<\/a> of 2 years and 4 semesters.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td>Sr. No.<br><\/td><td>Payment Options<br><\/td><td>Prime&nbsp;<br><\/td><td>Pro<br><\/td><\/tr><tr><td>1.<\/td><td>One –time full fee payment<br><\/td><td>120,000 INR<br><\/td><td>144,000 INR<br><\/td><\/tr><tr><td>2<\/td><td>Annual mode of payment<br><\/td><td>65,500 INR<br><\/td><td>77,500 INR<br><\/td><\/tr><tr><td>3<\/td><td>Semester wise fee payment<br><\/td><td>35,000 INR<br><\/td><td>41,000 INR<br><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>Students have the option of full fee payment, annual payment, or semester-wise payment and avail of a substantial discount on the first two options. The fee structure is also dependent on the mode of lecture delivery chosen by candidates that are prime and pro, subject-wise in each semester. With pro mode, students have access to live-interactive lectures as well as recorded lectures whereas in prime mode students have access to only recorded lectures but they can add live lectures for individual subjects at a fee of INR 1,200<\/p>\n\n\n\n<ul><li>An initial amount of 5000 INR from the program fees will be collected at the time of registration<\/li><li>The one-time Admission processing fee is 1,200 INR<\/li><li>Students need to pay an examination fee of 600 INR per subject<\/li><li>The University offers special incentives to the armed forces with a 20% concession.<\/li><li>Students also have the option to avail loan facility to pay program fees even without a credit card.<\/li><li>HDFC Bank, ICICI Bank, Axis Bank, Citi Bank, Standard Charted Bank, HSBC Bank, SBI, and Kotak Mahindra Bank provides EMI facility (3,6,9,12 months) via credit cards.<\/li><li>The fee structure for distance learning programs are subject to change at the discretion of the University<\/li><li>Payment has to be made via online mode or Demand Draft made in favor of the SVKM’s NMIMS payable at Mumbai.<\/li><\/ul>\n\n\n\n<p>All in all, a candidate doesn’t have to worry about NMIMS fees. It is actually affordable and can be paid in no cost EMIs. But most importantly, being one of the best business schools in India, completing an online or distance MBA from NMIMS, opens up varied avenues for a candidate. So wait not, if you are looking to elevate your career path and take up strategic roles in an organization wherein you directly contribute to achieving the company’s vision and objective, enroll today in distance MBA program from NMIMS.<\/p>\n\n\n\n<p><strong>You will like reading this: <a href=\"https:\/\/www.learningroutes.in\/highest-paying-jobs-after-mba-in-india\/\">Highest Paying Jobs After MBA in India<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are contemplating pursuing a distance MBA program then look no further as the NMIMS distance MBA program is one the top priority B-school that provides various specialization courses for masters, diploma, executive, and certification program. NMIMS Global Access School for Continuing Education&nbsp;is India’s No.1 Distance Management University with exceptional corporate collaboration, recognition, and &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/nmims-distance-mba-fees\/\"> <span class=\"screen-reader-text\">NMIMS Distance MBA Fees<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":8513,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[47],"tags":[101,103,104,105],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8512"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=8512"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8512\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/8513"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=8512"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=8512"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=8512"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}