{"id":8716,"date":"2021-08-14T15:29:54","date_gmt":"2021-08-14T09:59:54","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=8716"},"modified":"2021-08-14T15:29:54","modified_gmt":"2021-08-14T09:59:54","slug":"top-10-nmims-distance-learning-mba-programs","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/top-10-nmims-distance-learning-mba-programs\/","title":{"rendered":"Top 10 NMIMS Distance Learning MBA Programs"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"><strong>MBA in Marketing Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights –&nbsp;<\/strong><\/p>\n\n\n\n<ul><li>The two-year NMIMS Distance Learning MBA degree program offers a more profound comprehension of the different capacities and standards of showcasing, which can be essentially applied in the corporate world.&nbsp;<\/li><li>Refreshed courseware to keep in sync with the changing industry scene.<\/li><li>Investigate contemporary showcasing procedures and offers a comprehension of advertising at a territorial and worldwide level.&nbsp;<\/li><li>Comprehend the ideas of the executives and incorporate them with advertising the board.<\/li><li>Successfully explore the promoting fragment which incorporates both conventional and cutting edge advertising.<\/li><li>Effective fulfillment of this program will qualify you for a Master of Business Administration (Distance) degree confirmation<\/li><\/ul>\n\n\n\n<p>&nbsp;<strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Effectively develop a marketing plan that is cost conservative which also delivers maximum results&nbsp;<\/li><li>Skilfully recognize the objective business sectors and specialty correspondence that discussions to them in their language&nbsp;<\/li><li>Foster successful showcasing procedures and incorporated advertising efforts&nbsp;<\/li><li>Reinforce existing associations with clients and convert them into brand advocates.&nbsp;<\/li><li>Give you an edge over the opposition and assist you with making a way for an effective business vocation<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any recognised University or an equivalent degree recognised by Association of Indian Universities (AIU) with minimum 50% marks at Graduation Level.<\/li><\/ul>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Financial Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The two-year M.B.A degree program assists you with acquiring a superior comprehension of the basics of money, evaluating, bookkeeping, and capital administration.&nbsp;<\/li><li>Comprehend the standard and ideas of Finance just as its useful application while additionally learning the essentials of business the board.&nbsp;<\/li><li>Gain proficiency with the ideas of monetary examination, cost bookkeeping, board bookkeeping, and its effect on broad dynamics.&nbsp;<\/li><li>Devise monetary techniques, hazard appraisal, and capital venture.&nbsp;<\/li><li>Tackle basic and insightful thinking capacities about the students, to set them up for an arising business climate.&nbsp;<\/li><li>Gather fundamental monetary and administrative abilities, which will impact the functional parts of various business elements.<\/li><li>The fruitful culmination of this program will qualify you for a Master of Business Administration (Distance) degree confirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Break down and assess successful business procedures, practices, and hypotheses, which educate and guide associations to acquire manageability.&nbsp;<\/li><li>Plan answers for business challenges, by consolidating the executive&#8217;s practices and hypotheses with standards of showcasing, financial matters, bookkeeping, activities the board, and money.&nbsp;<\/li><li>Comprehend the standards of bookkeeping to guarantee arrangement with authoritative objectives and systems.&nbsp;<\/li><li>Capacity to make monetary procedures, hazard evaluation, and capital speculation.&nbsp;<\/li><li>Devise planning procedure dependent on the standards of capital planning, capital construction, cost of capital, corporate financing, and resource valuation, and so forth<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or an identical degree perceived by Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or identical degree perceived by Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Business Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The <a href=\"https:\/\/www.learningroutes.in\/nmims-distance-mba\/\">two-year M.B.A degree program<\/a> intends to furnish understudies with an outline of a business system and the usefulness of different plans of action&nbsp;<\/li><li>Urges understudies to utilize key speculation strategies to further develop hierarchical center abilities&nbsp;<\/li><li>Spotlights on modules like advertising, data innovation, financial aspects, business laws, hierarchical conduct, and so forth&nbsp;<\/li><li>Gives commonsense utilization of the executive&#8217;s standards through a contextual analysis philosophy&nbsp;<\/li><li>Offers the capacity to break down business systems and models&nbsp;<\/li><li>Offers advances into seeing how to deal with any business at a basic even out and upgrade its worth and working&nbsp;<\/li><li>Fruitful finish of this program will qualify you for a Master of Business Administration (Distance) degree accreditation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Comprehend different business financial structures&nbsp;<\/li><li>Expert ideas to widen and extend the key information and business thinking models&nbsp;<\/li><li>Join the executive&#8217;s practices and hypotheses with standards of advertising, financial matters, bookkeeping, tasks the board, and money for taking care of business issues&nbsp;<\/li><li>Get the capability to dissect business information, get experiences, and exhibit symptomatic critical thinking abilities to help the executives dynamic&nbsp;<\/li><li>Carry out and facilitate authoritative exercises through powerful initiative and group abilities&nbsp;<\/li><li>Survey the effect of worldwide cutthroat conditions to form powerful business systems to oversee them.<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree(10+2+3) in any discipline from any perceived University or an identical degree perceived by the Association of Indian Universities (AIU) with least half checks at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or identical degree perceived by the Association of Indian Universities (AIU) with under half checks at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Human Resource Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The four-semester program helps you in understanding the ideas of the executives and coordinate them with the standards of Human Resources on the board.&nbsp;<\/li><li>Improve and sharpen your kin the board abilities to establish a favorable workplace.&nbsp;<\/li><li>Become familiar with the essentials of ability preparing and selecting, maintenance, modern relations, hierarchical abilities, and their useful application in a professional workplace. ·&nbsp;<\/li><li>Comprehend the center substances of the executives and form individuals into capable assets.&nbsp;<\/li><li>Get to know the essentials of ability preparing and selecting, maintenance, mechanical relations, hierarchical abilities, and their functional application.&nbsp;<\/li><li>Gain a superior comprehension of the ideas of the executives and how to coordinate them with the standards of HR the board.&nbsp;<\/li><li>Foster HR and human resources comprehensively to become heads of tomorrow.&nbsp;<\/li><li>Effective accomplishment of this program will qualify you for a Master of Business Administration (Distance) degree confirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Recognizing the right applicants, putting them in a powerful job&nbsp;<\/li><li>Adequately overcoming any issues between the assumptions and consequences of the business and the worker.&nbsp;<\/li><li>Oversee HR through remunerations and acknowledgment.&nbsp;<\/li><li>The adjustability of the board to authoritative advantages.&nbsp;<\/li><li>Assemble an elite association through Human Resource Management.<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or an identical degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or identical degree perceived by Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in International Trade Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>Spread across four semesters, the itemized course construction will cover exchanging strategies, trade of capital, delivering and sourcing labor and products from across the globe.&nbsp;<\/li><li>Broad and exhaustive courseware fulfills the needs of the steadily changing worldwide norm.&nbsp;<\/li><li>Dissect world exchange, trade of capital, exchange advancement, arrangements, and methodologies at the provincial, public and worldwide levels.&nbsp;<\/li><li>Get familiar with the essentials of hazard the executives for international strategies, arising worldwide organizations, unfamiliar trade, just as evaluate the effect on the political and legitimate climate.&nbsp;<\/li><li>Get important abilities to evaluate exchange issues, source and produce products, comprehend draft strategy reports for the global market just as foster exchange the executive&#8217;s measures.&nbsp;<\/li><li>Recognize ideas for cross-line exchanging and burdens just as elements influencing worldwide organizations.&nbsp;<\/li><li>Effective fulfillment of this program will qualify you for a Master of Business Administration (Distance) degree confirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Construct powerful exchange the board measures&nbsp;<\/li><li>Oversee worldwide business sectors and business&nbsp;<\/li><li>Recognize different business the executives rehearses and show a worldwide outlook&nbsp;<\/li><li>Perceive and break down global super patterns, approaches, and methodologies&nbsp;<\/li><li>Survey hazard as per international strategy, new worldwide business, unfamiliar trade, political and legitimate climate.&nbsp;<\/li><li>Become a piece of the powerful worldwide labor force<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>&nbsp;&nbsp; &nbsp; &nbsp; OR&nbsp;<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Banking and Finance Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The two-year M.B.A degree program gives you top to bottom information on monetary business activities, approaches and to applies this information essentially.&nbsp;<\/li><li>Incorporate the standards of banking and money with the ideas of business activities.&nbsp;<\/li><li>Get the information to dissect and comprehend the powerful idea of banking and monetary administration, financial exchanges, protections, and the worldwide economy.&nbsp;<\/li><li>Comprehend everyday tasks and exercises of banking and money organizations.&nbsp;<\/li><li>Comprehend the various sorts of monetary foundations and their job in the monetary business sectors.&nbsp;<\/li><li>Procure information on advertising ideas and exercises identified with the unique prerequisites of monetary administrations.&nbsp;<\/li><li>Comprehend the basics of cost bookkeeping and the board bookkeeping and its effect on the monetary dynamic cycle.&nbsp;<\/li><li>Fruitful consummation of this program will qualify you for a Master of Business Administration (Distance) degree affirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Comprehend different business monetary structures&nbsp;<\/li><li>Expert ideas to expand and extend the major information and business thinking models&nbsp;<\/li><li>Join the board practices and hypotheses with standards of advertising, financial aspects, bookkeeping, activities the executives, and money for tackling business issues.&nbsp;<\/li><li>Capability to investigate business information, get bits of knowledge, and feature demonstrative critical thinking abilities to help the executives dynamic.&nbsp;<\/li><li>Execute and arrange hierarchical exercises through viable administration and group abilities&nbsp;<\/li><li>Evaluate the effect of worldwide serious conditions to figure viable business systems to oversee them.<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by the Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Supply Chain Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The two-year M.B.A degree program presents the ideas utilized in-store network the executives and dives further into the hypothesis and use of it.&nbsp;<\/li><li>Apply the ideas of tasks to the standards of business the executives&nbsp;<\/li><li>Represent the worth of acquisition, lean and stockroom the board, coordinations and stock administration in making a productive store network&nbsp;<\/li><li>Comprehend the cycles behind overseeing coordinations while utilizing innovation to augment the yield&nbsp;<\/li><li>Streamline cycles to control expenses and satisfy industry guidelines&nbsp;<\/li><li>Comprehend the significance of enormous and limited scope stock administration.&nbsp;<\/li><li>Effective finish of this program will qualify you for a Master of Business Administration (Distance) degree affirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Work with the advancement of an organization through a more successful SCM measure&nbsp;<\/li><li>Smooth out the capacities inside more extensive activity organizations and supply chains.&nbsp;<\/li><li>Successfully oversee activity abilities to recognize crisscrosses among request and supply.&nbsp;<\/li><li>Oversee inventory network activities to guarantee a &#8220;stream&#8221; of items and administrations to convey what the clients need at the value they need and the amount they need.&nbsp;<\/li><li>Viably tackle store network issues and oversee openings and difficulties in a universally worked business.<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by the Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>MBA in Operations Management<\/strong><\/h4>\n\n\n\n<p><strong>Highlights-&nbsp;<\/strong><\/p>\n\n\n\n<ul><li>During the two-year M.B.A degree program, you will figure out how to skilfully coordinate the essentials of business the board with the standards of activities the executives.&nbsp;<\/li><li>Fabricate proficient abilities underway and activities the board, dissemination channels and coordinations, obtainment the executives and quality administration, prompting an improvement in their work abilities.&nbsp;<\/li><li>Figure out how to quantify execution, upgrade creation, decide yield, improve limit, and cut activity costs.&nbsp;<\/li><li>Offset buying capability with supply mastery and general business information.&nbsp;<\/li><li>Foster, an inventive mentality to react to the always-changing business conditions and the intricacies of procedure on a worldwide stage.&nbsp;<\/li><li>Effective finish of this program will qualify you for a Master of Business Administration (Distance) degree affirmation<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Successfully apply activity standards to an ongoing business circumstance.&nbsp;<\/li><li>Comprehend the standards of creation relating to limit, inconstancy, creation stream, stock, etc.&nbsp;<\/li><li>Productively plan control and change assets as they travel through supply organizations, activities, and cycles.&nbsp;<\/li><li>Dissect business tasks utilizing different quantitative examination procedures&nbsp;<\/li><li>Apply the cycle viewpoint on an association or specialty unit level&nbsp;<\/li><li>Productively oversee both help and assembling activities&nbsp;<\/li><li>Apply quality administration instruments to measure improvement.<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by the Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>MBA in Retail Management<\/strong><\/h4>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>The two-year M.B.A degree program empowers you to incorporate ideas of general administration with the standards of retail the executives&nbsp;<\/li><li>Gain proficiency with the essentials of business the executives with an exceptional spotlight on retail the board&nbsp;<\/li><li>Recognize different exercises associated with the retail area&nbsp;<\/li><li>Perceive the basic job of coordination and store network the executives and the significance of administration alongside the danger in the coordinated retail area&nbsp;<\/li><li>The program assists you with understanding the monetary and cost suggestions in the retail area&nbsp;<\/li><li>Carry out choices relating to store area and its plan&nbsp;<\/li><li>Fruitful finish of this program will qualify you for a Master of Business Administration (Distance) degree certificate.<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Distinguish issues and devise arrangements in the retail executive&#8217;s area&nbsp;<\/li><li>Be adroit in arranging, assessing, fabricating, and choosing channels for retail dispersion&nbsp;<\/li><li>Viably oversee channels for retail and fabricate retail showcasing methodologies&nbsp;<\/li><li>Comprehend the administration of shops or large shopping centers and the complexities associated with their everyday exercises&nbsp;<\/li><li>Foster a promoting plan for new or existing items or administrations by coordinating showcasing ideas, methodologies, examination, and dissemination standards for retail.&nbsp;<\/li><li>Oversee retail location tasks and stock frameworks<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by the Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA in Information Technology and Systems Management<\/strong><\/h2>\n\n\n\n<p><strong>Highlights-<\/strong><\/p>\n\n\n\n<ul><li>Spread across four semesters, the program centers around helping the basics of innovation to assemble a unique profession in the data innovation commercial center.&nbsp;<\/li><li>The program creates basic reasoning, administrative abilities &amp;stresses the utilization of current methods to investigate and foster business arrangements in the IT field.&nbsp;<\/li><li>The courseware centers around acquainting members with the most recent innovation disturbing the current business situations.&nbsp;<\/li><li>The program acquaints applicants with different administration standards and practices, just as ideas of hierarchical conduct, data innovation in administration, and framework investigation, computerized installments, and endeavor asset arranging&nbsp;<\/li><li>Fruitful finishing of this program will qualify you for a Master of Business Administration (Distance) degree certificate.<\/li><\/ul>\n\n\n\n<p><strong>Outcomes-<\/strong><\/p>\n\n\n\n<ul><li>Evaluate suitable business techniques, practices, and speculations for business choices&nbsp;<\/li><li>Decide suitable data frameworks arrangements utilizing current and arising innovations&nbsp;<\/li><li>Exhibit capability in comprehension and dealing with the most basic issues of innovation venture&nbsp;<\/li><li>Oversee and take on innovations inside the transforming IT situation&nbsp;<\/li><li>Successfully comprehend the variables expected to start business measure reengineering<\/li><\/ul>\n\n\n\n<p><strong>Eligibility-<\/strong><\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or a comparable degree perceived by the Association of Indian Universities (AIU) with least half stamps at Graduation Level.&nbsp;<\/li><\/ul>\n\n\n\n<p>OR<\/p>\n\n\n\n<ul><li>Bachelor’s Degree (10+2+3) in any discipline from any perceived University or comparable degree perceived by the Association of Indian Universities (AIU) with under half stamps at Graduation level and at least 2 years of work insight.<\/li><\/ul>\n\n\n\n<p><strong>You will like reading this:&nbsp;<a href=\"https:\/\/www.learningroutes.in\/highest-paying-jobs-after-mba-in-india\/\">Highest Paying Jobs After MBA in India<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>MBA in Marketing Management Highlights –&nbsp; The two-year NMIMS Distance Learning MBA degree program offers a more profound comprehension of the different capacities and standards of showcasing, which can be essentially applied in the corporate world.&nbsp; Refreshed courseware to keep in sync with the changing industry scene. Investigate contemporary showcasing procedures and offers a comprehension &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/top-10-nmims-distance-learning-mba-programs\/\"> <span class=\"screen-reader-text\">Top 10 NMIMS Distance Learning MBA Programs<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":8718,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[47,56],"tags":[16,17,179,180,58,178],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8716"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=8716"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8716\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/8718"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=8716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=8716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=8716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}