{"id":8969,"date":"2021-12-02T17:08:49","date_gmt":"2021-12-02T11:38:49","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=8969"},"modified":"2021-12-02T17:08:49","modified_gmt":"2021-12-02T11:38:49","slug":"mba-chaiwala-business-success-story","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/mba-chaiwala-business-success-story\/","title":{"rendered":"MBA Chaiwala: Business Success Story"},"content":{"rendered":"\n<p>You can achieve everything you set your mind to if you believe in yourself. There are no limitations out here, and the only ones you set are for yourself. MBA Chai Wala&#8217;s owner, Prafull Billore, was determined to pursue his dreams and succeeded. He had his share of setbacks, but he overcame them to get to where he is now. His success story serves as an encouragement to today&#8217;s kids.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>His upbringing and challenges<\/strong><\/h2>\n\n\n\n<p>Prafull intended to get his master&#8217;s degree from IIM Ahmedabad before launching his own eatery. You must take the CAT in order to be accepted into a <a href=\"https:\/\/www.learningroutes.in\/nmims-ngasce\/\">good MBA program<\/a>. The CAT is regarded as one of the most demanding exams available. Prafull studied for over 10 hours a day to achieve his objectives. His parents wished him well and hoped he would pass his examinations. Unfortunately, he failed the CAT exam three times out of three attempts. Despite his failure, his parents continued to support him. Prafull became depressed as a result of this and was unable to concentrate on anything.<\/p>\n\n\n\n<p>He traveled around Ahmedabad for comfort during this time and discovered that it seemed like a second home to him. His dream of pursuing an <a href=\"https:\/\/www.learningroutes.in\/nmims-ngasce-mba-programs-q\/\">MBA<\/a> from IIM had been destroyed, and he didn&#8217;t know what to do next. Finally, I settled on a job at McDonald&#8217;s. He began his career as a housekeeper. He was quickly promoted to kitchen crew and began taking orders and serving clients.<\/p>\n\n\n\n<p>Despite the fact that he worked for a well-known company, he always wanted to accomplish more. The best approach to be independent and build your own personality is to start a business. He wanted to open a cafe, but he didn&#8217;t know how much it would cost. He abandoned the scheme because he lacked the necessary funds.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>MBA Chai Wala started with a bang.<\/strong><\/h2>\n\n\n\n<p>Prafull decided to open a roadside tea stall after much deliberation. Despite the fact that this put him in danger, he wanted to pursue his aspirations. People generally look down on these types of enterprises. They are thought to be carried out by lower-class or less-educated individuals. Prafull, on the other hand, was unfazed. Praful&#8217;s only concern was what his father would think. He experienced several sleepless nights as a result of this. He began his first business as a tea staller near McDonald&#8217;s with a lot of courage and determination. On July 25, 2017, he began his firm with an investment of merely INR 8,000. He worked at McDonald&#8217;s from 9 a.m. to 4 p.m. and then at his tea stall in the evening.<\/p>\n\n\n\n<p>When you have a small business, getting customers is difficult. A tea shop can be located on practically every street corner. Prafull served tea in earthen pots with toast and tissues to draw people in. He not only amused those who came to his stall, but he also approached those who were sitting in their automobiles. People were drawn to him because of his communication abilities and the distinctive method he served his meals.<\/p>\n\n\n\n<p>The adjacent tea stall vendors became envious of his success as his customer base grew. They formed a union and expelled Prafulll from the area. Prafull was now more confident in his ability to succeed as a result of this. He made contact with the proprietor of a neighboring hospital and hired a location near the hospital. Prafull set up a new tea stall and restarted his business for INR 10,000. His unusual technique of serving tea captivated customers here as well. He eventually began selling snacks and coffee.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>His first restaurant<\/strong><\/h2>\n\n\n\n<p>Prafull Billore opened his own restaurant, MBA Chaiwala, not long after. He explained that <a href=\"https:\/\/learningroutes.in\/nmims-mba\/\">MBA<\/a> stands for &#8216;Mr. Billore Ahmedabad Chaiwala,&#8217; not Master of Business Administration. Within a few months, his company was generating millions of dollars per month. Prafull Billore also maintains a personal website and is the Facebook and Instagram manager for MBA Chaiwala. He is well-known among young people, particularly MBA students at IIM Ahemdabad. He&#8217;s also spoken at over 200 events, including women&#8217;s empowerment programs, entrepreneurship events, and more. On Valentine&#8217;s Day, he gave away free chai to single people. This went viral across all social media platforms, and he gained international prominence as a result.<\/p>\n\n\n\n<p>He had a revenue of Rs 3 crore in the financial year 2019-20. Prafull adds, &#8220;My ambition is to sell tea all over the country and have every Indian consume my tea.&#8221; He runs a 300-square-foot restaurant with a staff of over 20 people.<\/p>\n\n\n\n<p>Prafull&#8217;s experience teaches us that anything is achievable if you are focused, determined, and truly want to achieve your goals. Taking a risk in order to achieve something necessitates the guts to face the dread of the unknown. Regardless of the outcome, we learn to be more resilient and confident as a result of the experience.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can achieve everything you set your mind to if you believe in yourself. There are no limitations out here, and the only ones you set are for yourself. MBA Chai Wala&#8217;s owner, Prafull Billore, was determined to pursue his dreams and succeeded. He had his share of setbacks, but he overcame them to get &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/mba-chaiwala-business-success-story\/\"> <span class=\"screen-reader-text\">MBA Chaiwala: Business Success Story<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":8971,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[47],"tags":[214,55,20,216,217,218],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8969"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=8969"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/8969\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/8971"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=8969"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=8969"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=8969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}