{"id":9240,"date":"2022-02-21T15:18:07","date_gmt":"2022-02-21T09:48:07","guid":{"rendered":"https:\/\/www.learningroutes.in\/?p=9240"},"modified":"2022-02-21T15:18:07","modified_gmt":"2022-02-21T09:48:07","slug":"impact-of-covid-19-on-education-sector","status":"publish","type":"post","link":"https:\/\/www.learningroutes.in\/impact-of-covid-19-on-education-sector\/","title":{"rendered":"Impact of Covid-19 on Education Sector"},"content":{"rendered":"\n<p>2019 was the year that changed everything. The covid-19 outbreak took a toll on each and every person around the world. Nobody could’ve anticipated a pandemic in these modern times. Each nation suffered brutally, some were able to tackle it while some kept suffering. Millions of people died across continents, every country faced huge losses- whether it be the dying citizens or economic crisis. With the help of science and technology and hardworking researchers, we were able to discover methods to prevent the outbreak and save the lives of people. Strict rules for Social distancing, wearing a face mask and regular sanitization were enforced by all the countries. In order to ensure social distancing at all times, many public places were shut down like schools, colleges, offices, etc. This measure had a huge impact on the educational and many other industries.<\/p>\n\n\n\n<p><a href=\"https:\/\/en.wikipedia.org\/wiki\/COVID-19\">Covid-19<\/a> gave the educational industry a complete transformation. Thanks to ever-evolving technology, learning wasn’t put at a halt. All the traditional teaching methods were replaced by online teaching methodologies. Entire student and teacher population shifted to online platforms. In this way, it was made sure that the education and learning of students does not get compromised due to the ongoing pandemic. In most of educational institutions, Teachers were provided with competent gadgets and software to ensure regular and smooth delivery of online classes to students from their respective homes. The whole narrative of traditional teaching was changed. Students were provided with facilities like live lectures, recorded lectures, e-libraries, online doubt solving sessions, webinars, and so on. Students were able to access all the resources of knowledge at the ease of their homes and at flexible times. The online education industry was booming owing to its ease of accessibility at the times of Covid-19.<\/p>\n\n\n\n<p>However, there are several downsides to online education methodologies. India, still being a developing nation, the resources are not accessible to all parts of the population. There are many educational institutions who don’t have the resources to provide the faculty members with the necessary gadgets to conduct online classes. This is the case on the students’ side too, many students belong to unprivileged areas and do not have access to digital devices, this becomes a massive barrier between them and their education. This leaves the students as well as the teachers helpless.<\/p>\n\n\n\n<p>Many students used to attend school solely for the mid-day meals, hence for them, life would’ve become really difficult after the closure of all educational institutions.<\/p>\n\n\n\n<p>Teacher’s who used to teach on black boards and were experts in teaching offline also faced a lot of difficulties while adapting to the high-tech methods for teaching.<\/p>\n\n\n\n<p>There are many downsides to online teaching and the closure of schools and colleges but all these measures were for the good and safety of people. Governments of various nations only had one agenda- to save the lives of their citizens.  After all, as they say “health is wealth”. Therefore, all these measures were crucial in curbing the impact of Covid-19 on the entire human race.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>2019 was the year that changed everything. The covid-19 outbreak took a toll on each and every person around the world. Nobody could’ve anticipated a pandemic in these modern times. Each nation suffered brutally, some were able to tackle it while some kept suffering. Millions of people died across continents, every country faced huge losses- &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/impact-of-covid-19-on-education-sector\/\"> <span class=\"screen-reader-text\">Impact of Covid-19 on Education Sector<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":9242,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"categories":[10],"tags":[237,238,239,240],"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/9240"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=9240"}],"version-history":[{"count":0,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/posts\/9240\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media\/9242"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=9240"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/categories?post=9240"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/tags?post=9240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}