{"id":11428,"date":"2023-04-12T07:55:32","date_gmt":"2023-04-12T07:55:32","guid":{"rendered":"https:\/\/www.learningroutes.in\/new-website\/?page_id=11428"},"modified":"2023-04-12T07:58:23","modified_gmt":"2023-04-12T07:58:23","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/www.learningroutes.in\/terms-of-use\/","title":{"rendered":"Terms Of Use"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"11428\" class=\"elementor elementor-11428\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-38c7eec elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"38c7eec\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-654ac03\" data-id=\"654ac03\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-inner-section elementor-element elementor-element-94ca7db elementor-section-content-middle elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"94ca7db\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-inner-column elementor-element elementor-element-c217639\" data-id=\"c217639\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-e53f916 elementor-widget elementor-widget-heading\" data-id=\"e53f916\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.12.1 - 02-04-2023 *\/\n.elementor-heading-title{padding:0;margin:0;line-height:1}.elementor-widget-heading .elementor-heading-title[class*=elementor-size-]>a{color:inherit;font-size:inherit;line-height:inherit}.elementor-widget-heading .elementor-heading-title.elementor-size-small{font-size:15px}.elementor-widget-heading .elementor-heading-title.elementor-size-medium{font-size:19px}.elementor-widget-heading .elementor-heading-title.elementor-size-large{font-size:29px}.elementor-widget-heading .elementor-heading-title.elementor-size-xl{font-size:39px}.elementor-widget-heading .elementor-heading-title.elementor-size-xxl{font-size:59px}<\/style><h1 class=\"elementor-heading-title elementor-size-default\">TERMS OF USE\n<\/h1>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-45d881c elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"45d881c\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-bec1a62\" data-id=\"bec1a62\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-a93fb1f elementor-widget elementor-widget-text-editor\" data-id=\"a93fb1f\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.12.1 - 02-04-2023 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#69727d;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#69727d;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<h2>Please read the following carefully<\/h2><p>These terms and conditions (“Terms and Conditions”) control your use of this website learningroutes.in (“Website”). In these Terms and Conditions, “Learning Routes” is referred to as the “Company”, “us,” or “we.”<\/p><p>‘You’ refers to a user or a paying customer. If you are a company or another person who gives access to company products, you agree to take responsibility in full in case of damages or indemnification that could properly lie against the customer.<\/p><p>The Learning Routes website (the ‘Site’), the educational services made available through the site and the content (the ‘Products’) are owned, operated and maintained, as applicable, by Learning Routes (‘we’, ‘our’, ‘us’, or the ‘Company’). The Site, Products and Content are, collectively, the ‘Company Products’.<\/p><p>By (a) using or accessing the Company Products, including, but not limited to downloading or accessing, (b) offering a Course through the Site or through Software; you agree to the terms and conditions set forth in these Terms of Use (the “Terms”)<\/p><p>By using this website or its Products and Services, You Agree and Warrant that you have read, understood, and agreed to be Bound by these terms. Company’s privacy policy can be found at Privacy Policy. If you do not accept these terms, you must not use – and are not authorized to use – all or any portion of the company’s website and its products or services (as defined below).<\/p><h2>Please read them carefully before you use the services of this site.<\/h2><ul><li>You should not use this site in an unlawful manner; you must respect the website terms and conditions and follow the Privacy Policy.<\/li><li>Under no situations or circumstances, will the company be liable for any change in the content which it provides on the website through its products and services, including but not limited to any errors, omissions, loss, or damage experienced in connection with the use of exposure, any content made available via our products, services, or various resources such as email, blog etc.<\/li><li>Our services are free to any user with access to the Internet. However, we are not responsible for the charges incurred for the usage of hardware, software, or internet services provider fee. Also, the user is fully responsible for the proper functioning of computer hardware and internet access.<\/li><li>You will be required to use login credentials for some of the sections on the site and the company reserves the right to block access to our services for any user who does not follow these conditions<\/li><li>We make sure that users get uninterrupted access to our service, but there is no obligation to do so.<\/li><li>Learning Routes is not responsible and is not obligated for issues in your network or server beyond certain limits.<\/li><\/ul><h2>Website usage guidelines<\/h2><ul><li>Do not insult, abuse, harass, stalk, threaten, or otherwise infringe the rights of others;<\/li><li>Do not publish, post, distribute or disseminate any defamatory, infringing, indecent, offensive or unlawful material or information.<\/li><li>Do not upload, install, transfer files which are protected by Intellectual Property Laws or software which affect other computers.<\/li><li>It’s prohibited to edit HTML source code, reverse engineer or attempt to hack.<\/li><li>Do not run Spam services\/scripts or anything which could affect the infrastructure, and in turn, the users.<\/li><li>Do not communicate spam, advertise, or sell services such as digital downloads, eBooks, or phishing links.<\/li><li>You may not copy, distribute, and indulge in plagiarism with website content or user submitted content.<\/li><li>Do not use any content which violates any legal, regulatory, Governmental or network operator conditions or codes of practice.<\/li><\/ul><h2>Links and Hyperlinks Terms<\/h2><p>This website may have links to other websites. We do not undertake any control on the content of these websites; nor are we responsible for their website content. The sole purpose of the links included are to provide users information. Hence, Learning Routes will not be held responsible.<\/p><ul><li>You may not mirror or frame the homepage or any other pages of this Site on any other website or webpage.<\/li><li>Do not link to Learning Routes pages and subpages with spam links\/anchor text, which could provide a false impression. This may create misunderstandings for the users.<\/li><li>Do not use or include copyrighted or registered trademarks, or Intellectual property images, design, or content as a link to the Learning Routes website.<\/li><li>Do not link to pages which support racism, terrorism.<\/li><li>Do not link to pages that provide pornographic content and violate human and animal rights.<\/li><li>Do not link pages to the content that infringes the intellectual property of any third party, person or entity.<\/li><li>Do not link pages to the content that violates any legal, regulatory, Governmental or network operator conditions or codes of practice.<\/li><\/ul><h2>Copyright and Intellectual Property<\/h2><p>We value and respect others intellectual property and expect our users to do the same.<\/p><p>The entire contents of the Site are protected by copyright and trademark laws. The owner of the copyrights and trademarks are learningroutes.in, its affiliates, or other third party licensors. The material on the site, including text, graphics, code, and\/or software is copyrighted and belongs to Learning Routes, therefore you may not duplicate, modify, publish, or reproduce the content in any manner.<\/p><p>Learning Routes does not take any responsibility for the content on other sites (except our partners and affiliates), that you may find when searching or accessing Learning Routes products or services. The Privacy Policy and Terms of Use of the sites that you visit will administer that material.<\/p><p>Learning Routes has all the rights to disable or prohibit access to the users who do not respect and involve in the infringement of Learning Routes intellectual property.<\/p><p>You are not allowed to use any of the digital images or logos from the website. In case of copyright issues, there has to be a written consent from the trademark owner.<\/p><h2>Claims of Intellectual Property Violations<\/h2><p>If you believe that your work has been used without your permission in a way which prompts for copyright infringement. Please provide us with the information given below and we will act on it.<\/p><ul><li>The authorized person who will act on behalf of the owner of the copyright, should send a digital or physical signature.<\/li><li>A description of the copyrighted work that you claim to be infringing your IP.<\/li><li>A description of where and how the material that you claim is infringing is located on the Learning Routes website, with enough detail that we may find it on the website.<\/li><li>Contact Details – Address, telephone number, and email address.<\/li><li>A statement by you, that the information which you provided is accurate and your claim of the copyright or intellectual property is on your owner’s behalf<\/li><li>You can reach Learning Routes to notify your claims of copyright by writing us.<\/li><\/ul><h2>Transaction Terms<\/h2><p>If you believe that your work has been used without your permission in a way which prompts for copyright infringement. Please provide us with the information given below and we will act on it.<\/p><ul><li>To make a transaction on the Learning Routes website, you are bound to pay for that transaction.<\/li><li>Please pay close attention to your payment details such as total bill, taxes, shipping costs, and discounts.<\/li><li>There are certain products that require additional Terms and Conditions which you have to agree to before you make the purchase.<\/li><li>If a delegate has completed the course and is eligible for a certificate, then same shall be delivered to the address provided by the delegate within 30 working days.<\/li><\/ul><p>WE MAKE NO WARRANTIES OF ANY KIND, EXPRESSED OR IMPLIED, WITH RESPECT TO ANY PRODUCTS OR SERVICES SOLD ON OR THROUGH Learning Routes.<\/p><p>No additional or different terms contained in any purchase order, document, transmission or other communication shall be binding upon Learning Routes unless agreed to by Learning Routes in writing.<\/p><p>Learning Routes reserves the right to modify, change without prior notice and in its sole discretion, to limit the order quantity on any item and to refuse service to anyone.<\/p><h2>LIMIT OF LIABILITY<\/h2><p>You expressly understand and agree that the Company shall not be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including, damages for loss of profits, goodwill, use, data or other intangible losses (even if the Company has been advised of the possibility of such damages), resulting from: (i) the use or the inability to use the service; (ii) the cost of procurement of substitute goods and services resulting from any goods, or services purchases or obtained or messages received or transactions entered into through or from the Website or otherwise; (iii) unauthorized access to or alteration of your transmissions or data or confidential information; (iv) statements or conduct of any third party on the Products; (v) or (v) any other matter relating to the Products.<\/p><h2>INDEMNITY<\/h2><p>You agree to indemnify and hold the Company and our subsidiaries, affiliates, officers, directors, agents, and employees, harmless from any claim or demand (including legal expenses and the expenses of other professionals) made by a third party due to or arising out of your breach of this Terms of Use or the documents it incorporates by reference, or your violation of any law or the rights of a third party.<\/p><h2>Pricing Disclaimer<\/h2><p>All prices, products, and offers of Learning Routes website are subject to change without notice.<\/p><p>While we make sure to provide most accurate and up-to-date information, in some cases one or more items on our website may be priced incorrectly. This might happen due to human errors, digital images, technical errors, or a mismatch in pricing information received from our suppliers.<\/p><p>Learning Routes reserves the right to change prices for all our products, offers, or deals. These changes are done due to market conditions, course termination, providers, price changes, errors in advertisements, and other mitigating circumstances. However, the price you paid at the time of purchase still holds for you.<\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>TERMS OF USE Please read the following carefully These terms and conditions (“Terms and Conditions”) control your use of this website learningroutes.in (“Website”). In these Terms and Conditions, “Learning Routes” is referred to as the “Company”, “us,” or “we.” ‘You’ refers to a user or a paying customer. If you are a company or another &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/www.learningroutes.in\/terms-of-use\/\"> <span class=\"screen-reader-text\">Terms Of Use<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"disabled","ast-breadcrumbs-content":"","ast-featured-img":"disabled","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":""},"_links":{"self":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/pages\/11428"}],"collection":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/comments?post=11428"}],"version-history":[{"count":4,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/pages\/11428\/revisions"}],"predecessor-version":[{"id":11432,"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/pages\/11428\/revisions\/11432"}],"wp:attachment":[{"href":"https:\/\/www.learningroutes.in\/wp-json\/wp\/v2\/media?parent=11428"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}